<template>
  <div>
    <Header />
    <Top />
    <main style="margin-top: 0.5em">
      <div class="container">
        <div class="left" style="width: 80%">
          <div class="card" style="position: relative">
            <div class="tips" style="margin-bottom: 0.5em">
              <i class="fa fa-bars"></i>&nbsp;&nbsp;<a href="/">首页</a> /
              RBAC权限系统分析、设计与实现
            </div>

            <div
              id="test-editormd-view2"
              class="markdown-body editormd-html-preview"
            >
              <p>
                转载请备注来源：
                <a href="https://shuwoom.com/?p=3041"
                  >《RBAC权限系统分析、设计与实现》</a
                >
                | <a href="http://shuwoom.com/">shuwoom.com</a>
              </p>
              <p>
                最近，因为项目上需要设计实现一个权限管理模块，所以专门整理总结了RBAC的一些知识。
              </p>
              <p>
                目前，使用最普遍的权限管理模型正是RBAC（Role-Based Access
                Control）模型，这篇文章也主要是介绍基于RBAC的权限管理系统，我会从RBAC是什么、如何设计RBAC两部分来介绍。
              </p>
              <h1 id="h1--rbac-">
                <a name="一、RBAC是什么" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >一、RBAC是什么
              </h1>
              <h2 id="h2-1-rbac-">
                <a name="1、RBAC模型概述" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >1、RBAC模型概述
              </h2>
              <p>
                RBAC模型（Role-Based Access
                Control：基于角色的访问控制）模型是20世纪90年代研究出来的一种新模型，但其实在20世纪70年代的多用户计算时期，这种思想就已经被提出来，直到20世纪90年代中后期，RBAC才在研究团体中得到一些重视，并先后提出了许多类型的RBAC模型。其中以美国George
                Mason大学信息安全技术实验室（LIST）提出的<a
                  href="https://www.profsandhu.com/infs767/infs767fall03/lecture01-2.pdf"
                  >RBAC96</a
                >模型最具有代表，并得到了普遍的公认。
              </p>
              <p>
                RBAC认为权限授权的过程可以抽象地概括为：Who是否可以对What进行How的访问操作，并对这个逻辑表达式进行判断是否为True的求解过程，也即是将权限问题转换为What、How的问题，Who、What、How构成了访问权限三元组，具体的理论可以参考RBAC96的论文，这里我们就不做详细的展开介绍，大家有个印象即可。
              </p>
              <h2 id="h2-2-rbac-">
                <a name="2、RBAC的组成" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >2、RBAC的组成
              </h2>
              <p>
                在RBAC模型里面，有3个基础组成部分，分别是：用户、角色和权限。
              </p>
              <p>
                RBAC通过定义角色的权限，并对用户授予某个角色从而来控制用户的权限，实现了用户和权限的逻辑分离（区别于ACL模型），极大地方便了权限的管理
              </p>
              <p>下面在讲解之前，先介绍一些名词：</p>
              <ul>
                <li>
                  User（用户）：每个用户都有唯一的UID识别，并被授予不同的角色
                </li>
                <li>Role（角色）：不同角色具有不同的权限</li>
                <li>Permission（权限）：访问权限</li>
                <li>用户-角色映射：用户和角色之间的映射关系</li>
                <li>角色-权限映射：角色和权限之间的映射</li>
              </ul>
              <p>它们之间的关系如下图所示：</p>
              <p>
                <img
                  src="https://shuwoom.com/wp-content/uploads/2019/04/rbacrole-based-access-control-1.png"
                  alt="img"
                />
              </p>
              <p>
                例如下图，管理员和普通用户被授予不同的权限，普通用户只能去修改和查看个人信息，而不能创建创建用户和冻结用户，而管理员由于被授
                予所有权限，所以可以做所有操作。
              </p>
              <p>
                例如下图，管理员和普通用户被授予不同的权限，普通用户只能去修改和查看个人信息，而不能创建创建用户和冻结用户，而管理员由于被授予所有权限，所以可以做所有操作。
              </p>
              <p>
                <img
                  src="https://shuwoom.com/wp-content/uploads/2019/04/rbac-demo.png"
                  alt="rbac说明图"
                />
              </p>
              <h2 id="h2-3-rbac-">
                <a name="3、RBAC支持的安全原则" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >3、RBAC支持的安全原则
              </h2>
              <p>
                RBAC支持三个著名的安全原则：最小权限原则、责任分离原则和数据抽象原则
              </p>
              <ul>
                <li>
                  最小权限原则：RBAC可以将角色配置成其完成任务所需的最小权限集合
                </li>
                <li>
                  责任分离原则：可以通过调用相互独立互斥的角色来共同完成敏感的任务，例如要求一个计账员和财务管理员共同参与统一过账操作
                </li>
                <li>
                  数据抽象原则：可以通过权限的抽象来体现，例如财务操作用借款、存款等抽象权限，而不是使用典型的读、写、执行权限
                </li>
              </ul>
              <h2 id="h2-4-rbac-">
                <a name="4、RBAC的优缺点" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >4、RBAC的优缺点
              </h2>
              <p>（1）优点：</p>
              <ul>
                <li>简化了用户和权限的关系</li>
                <li>易扩展、易维护</li>
              </ul>
              <p>（2）缺点：</p>
              <ul>
                <li>
                  RBAC模型没有提供操作顺序的控制机制，这一缺陷使得RBAC模型很难适应哪些对操作次序有严格要求的系统
                </li>
              </ul>
              <h2 id="h2-5-rbac-3-">
                <a name="5、RBAC的3种模型" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >5、RBAC的3种模型
              </h2>
              <h3 id="h3--1-rbac0">
                <a name="（1）RBAC0" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >（1）RBAC0
              </h3>
              <p>RBAC0，是最简单、最原始的实现方式，也是其他RBAC模型的基础。</p>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/rbac0.png"
                  alt="rbac0模型图"
                />
              </p>
              <p>
                在该模型中，用户和角色之间可以是多对多的关系，即一个用户在不同场景下是可以有不同的角色，例如：项目经理也可能是组长也可能是架构师。同时每个角色都至少有一个权限。这种模型下，用户和权限被分离独立开来，使得权限的授权认证更加灵活。
              </p>
              <h3 id="h3--2-rbac1">
                <a name="（2）RBAC1" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >（2）RBAC1
              </h3>
              <p>
                基于RBAC0模型，引入了角色间的继承关系，即角色上有了上下级的区别。
              </p>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/rbac1.png"
                  alt="rbac1模型图"
                />
              </p>
              <p>
                角色间的继承关系可分为一般继承关系和受限继承关系。一般继承关系仅要求角色继承关系是一个绝对偏序关系，允许角色间的多继承。而受限继承关系则进一步要求角色继承关系是一个树结构，实现角色间的单继承。
              </p>
              <p>这种模型适合于角色之间层次分明，可以给角色分组分层。</p>
              <h3 id="h3--3-rbac2">
                <a name="（3）RBAC2" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >（3）RBAC2
              </h3>
              <p>RBAC2，基于RBAC0模型的基础上，进行了角色的访问控制。</p>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/rbac2.png"
                  alt="rbac2模型图"
                />
              </p>
              <p>
                RBAC2中的一个基本限制是互斥角色的限制，互斥角色是指各自权限可以互相制约的两个角色。对于这类角色一个用户在某一次活动中只能被分配其中的一个角色，不能同时获得两个角色的使用权。
              </p>
              <p>该模型有以下几种约束：</p>
              <ul>
                <li>
                  互斥角色
                  ：同一用户只能分配到一组互斥角色集合中至多一个角色，支持责任分离的原则。互斥角色是指各自权限互相制约的两个角色。对于这类角色一个用户在某一次活动中只能被分配其中的一个角色，不能同时获得两个角色的使用权。常举的例子：在审计活动中，一个角色不能同时被指派给会计角色和审计员角色。
                </li>
                <li>
                  基数约束
                  ：一个角色被分配的用户数量受限；一个用户可拥有的角色数目受限；同样一个角色对应的访问权限数目也应受限，以控制高级权限在系统中的分配。例如公司的领导人有限的；
                </li>
                <li>
                  先决条件角色
                  ：可以分配角色给用户仅当该用户已经是另一角色的成员；对应的可以分配访问权限给角色，仅当该角色已经拥有另一种访问权限。指要想获得较高的权限，要首先拥有低一级的权限。就像我们生活中，国家主席是从副主席中选举的一样。
                </li>
                <li>
                  运行时互斥
                  ：例如，允许一个用户具有两个角色的成员资格，但在运行中不可同时激活这两个角色。
                </li>
              </ul>
              <h1 id="h1--rbac">
                <a name="二、如何设计RBAC" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >二、如何设计RBAC
              </h1>
              <p>
                这一节，我会介绍设计基于RBAC模型的权限系统的功能模块组成、流程以及数据库的设计。
              </p>
              <h2 id="h2-1-rbac-">
                <a name="1、RBAC的功能模块" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >1、RBAC的功能模块
              </h2>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/RBAC%E6%A8%A1%E5%9D%97%E5%8A%9F%E8%83%BD.png"
                  alt="rbac功能模块"
                />
              </p>
              <h2 id="h2-2-rbac-">
                <a name="2、RBAC执行流程" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >2、RBAC执行流程
              </h2>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/RBAC%E6%B5%81%E7%A8%8B.png"
                  alt="rbac执行流程"
                />
              </p>
              <h2 id="h2-3-rbac-">
                <a name="3、RBAC数据库设计" class="reference-link"></a
                ><span class="header-link octicon octicon-link"></span
                >3、RBAC数据库设计
              </h2>
              <p>
                <img
                  src="https://shuwoom.oss-cn-beijing.aliyuncs.com/rbac%E6%95%B0%E6%8D%AE%E5%BA%93%E8%AE%BE%E8%AE%A1.png"
                  alt="rbac数据库设计"
                />
              </p>
              <p>
                转载请备注来源：
                <a href="https://shuwoom.com/?p=3041"
                  >《RBAC权限系统分析、设计与实现》</a
                >
                | <a href="http://shuwoom.com/">shuwoom.com ﻿</a>
              </p>
            </div>
            <span
              style="
                color: #cecdcd;
                display: block;
                text-align: center;
                font-size: 0.85em;
                user-select: none;
              "
              id="end"
              ><b>THE END</b></span
            >
            <div
              style="
                display: flex;
                justify-content: space-between;
                padding: 0.5em;
                font-size: 0.9em;
                color: grey;
              "
            >
              <div>上次更新：1天前</div>
              <div></div>
            </div>
            <div class="post-end-tool-btns">
              <div
                class="post-share-btn post-end-tool-btn-item"
                onclick="showplane('.post-share-btn','#share-plane',event)"
              >
                <svg class="icon" viewBox="0 0 1024 1024">
                  <path
                    d="M793.472 102.208c-70.592 0-128 57.408-128 128 0 7.744 0.96 15.232 2.304 22.656L273.6 422.976C250.368 399.04 217.92 384 181.952 384c-70.592 0-128 57.408-128 128 0 70.592 57.408 128 128 128 22.912 0 44.096-6.592 62.72-17.152l289.088 180.992c-4.672 13.312-7.744 27.392-7.744 42.24 0 70.592 57.408 128 128 128s128-57.408 128-128-57.408-128-128-128c-32.512 0-61.888 12.544-84.48 32.64L291.712 576.832C302.976 557.696 309.952 535.744 309.952 512c0-11.456-1.984-22.336-4.8-32.896l389.76-168.32c23.488 28.672 58.752 47.36 98.624 47.36 70.592 0 128-57.408 128-128S864.064 102.208 793.472 102.208zM117.952 512c0-35.264 28.736-64 64-64s64 28.736 64 64-28.736 64-64 64S117.952 547.264 117.952 512zM654.016 782.144c35.328 0 64 28.672 64 64s-28.672 64-64 64-64-28.672-64-64S618.688 782.144 654.016 782.144zM793.472 294.208c-35.328 0-64-28.736-64-64s28.672-64 64-64 64 28.736 64 64S828.8 294.208 793.472 294.208z"
                  ></path>
                </svg>
                分享
              </div>
              <div
                class="post-qrcode-btn post-end-tool-btn-item"
                onclick="showplane('.post-qrcode-btn','#qrcode-plane',event)"
              >
                <svg
                  t="1599190411371"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="2306"
                  width="200"
                  height="200"
                >
                  <path
                    d="M742.8 121.5c-2.3 0.3-4.7 0.1-7 0.1-38 0-76-0.1-114 0.1-11 0-21.9 1.4-32.4 5.1-18.6 6.5-29.8 19.5-34.4 38.4-1.7 7-2.4 14.1-2.4 21.3 0 67.2-0.1 134.3 0.1 201.5 0 13.8 0.9 27.6 6.2 40.8 6.9 17.1 19.7 27.2 37.3 31.7 6.3 1.6 12.8 2.2 19.3 2.2h218c8.3 0 16.6-0.7 24.8-2.3 24.4-4.5 40.4-20.7 44.9-45 0.4-2.2-0.4-5.2 2.9-6.2v-232c-0.4-0.4-0.5-0.9-0.5-1.5-1.5-4.8-1.7-9.8-3.3-14.7-7.1-21-21.7-33.4-42.8-38.8-6.4-1.6-12.8-2.4-19.5-2.1-1.3 0.1-3 1-3.9-0.9h-89c-0.4 2.6-2.7 2.1-4.3 2.3z m98.7 40.7c4 0 8.1 0.9 11.9 2.1 6.9 2.2 10.7 7.6 10.7 15.1 0 74.8 0.1 149.6-0.1 224.4 0 11.2-8.6 18-21.1 18.1-38.2 0.3-76.3 0.1-114.5 0.1h-113c-4.5 0-8.6-1.3-12.7-2.7-8.5-3.1-9.6-10.5-9.7-17.9-0.2-37.5-0.1-75-0.1-112.5V183.4c0-6.5 1.5-12.5 6.9-17 4.6-3.8 10.3-4.3 15.6-4.3 75.4-0.1 150.8 0 226.1 0.1z"
                    p-id="2307"
                  ></path>
                  <path
                    d="M742 120c-39.5 0.1-79 0.1-118.4 0.1-9.4 0-18.6 1-27.7 3.1-11.6 2.7-22.1 7.7-30 16.7-10.6 12.1-14.8 26.9-14.8 42.6-0.2 69.6-0.2 139.3 0 208.9 0 9.1 0.7 18.3 2.8 27.2 2.8 11.7 7.6 22.5 16.7 30.5 11.7 10.3 25.9 15 41.5 15 74.1 0.1 148.3 0.1 222.4 0 9.3 0 18.7-0.5 27.7-3 19-5.4 33.6-15.9 40-35.8 1.7-5.3 1.8-10.9 3.8-16.1-3.2 1-2.5 4-2.9 6.2-4.5 24.4-20.5 40.5-44.9 45-8.2 1.5-16.5 2.3-24.8 2.3h-218c-6.5 0-13-0.6-19.3-2.2-17.5-4.5-30.4-14.6-37.3-31.7-5.3-13.1-6.2-27-6.2-40.8-0.2-67.2-0.1-134.3-0.1-201.5 0-7.2 0.7-14.3 2.4-21.3 4.6-18.9 15.8-31.9 34.4-38.4 10.5-3.7 21.4-5 32.4-5.1 38-0.2 76-0.1 114-0.1 2.3 0 4.7 0.2 7-0.1 1.7-0.2 3.9 0.2 4.2-2.4-1.2 2.1-3.2 0.9-4.9 0.9zM120.6 410.3c2 12.5 5.5 24.4 14.3 34 11.5 12.7 26.5 18 43 18.1 75.1 0.3 150.2 0.3 225.4 0 9.4 0 18.9-1 28.1-3.9 24.5-7.7 39.1-27.3 39.1-53.1 0-74 0-147.9 0.1-221.9 0-6.4-0.8-12.6-2.4-18.8-5.8-22.4-24.5-39.1-47.5-42.3-4.1-0.6-8.2-1.1-12.4-1.1-2 0-4.5 0.6-5.2-2.4h-89c-1.3 2.1-3.3 0.9-4.9 0.9-41.1 0.1-82.2-0.2-123.3 0.2-14.8 0.1-29.2 2.6-42.2 10.7-12.5 7.8-19.8 19.1-23.7 33-0.8 2.7-0.2 5.7-1.9 8.2v233c2.9 0.9 2.2 3.5 2.5 5.4z m39.5-231c0-8.1 6.2-14.6 14.5-16.3 4.4-0.9 8.8-1 13.2-1h219c4.3 0 8.4 0.8 12.4 2 7.5 2.4 10.8 6.9 10.8 14.6v225.5c0 8.2-3.8 13.3-11.6 15.9-4 1.3-8.1 2.1-12.4 2-37.2-0.1-74.3-0.1-111.5-0.1-37.7 0-75.3 0.1-113-0.1-6.3 0-12.6-0.9-17.3-6.1-2.7-3-4.1-6.3-4.1-10.1-0.1-75.3-0.1-150.8 0-226.3z"
                    p-id="2308"
                  ></path>
                  <path
                    d="M119 407.5c0.1 8.9 2.6 17.3 6.4 25.1 10.4 21.4 28.9 31 51.6 31.2 74.5 0.6 149 0.2 223.4 0.2 9.3 0 18.6-0.8 27.7-3 27.1-6.7 43.6-26.4 43.8-54.4 0.5-73.8 0.2-147.6 0.2-221.4 0-4.9 0-9.8-0.9-14.7-3-16.2-10.7-29.4-24.2-39-11-7.8-23.5-11-36.9-11.4-2.3-0.1-4.9 1.2-6.9-0.9 0.7 3 3.3 2.4 5.2 2.4 4.2 0 8.3 0.6 12.4 1.1 23 3.2 41.7 19.9 47.5 42.3 1.6 6.2 2.4 12.4 2.4 18.8-0.1 74 0 147.9-0.1 221.9 0 25.7-14.6 45.3-39.1 53.1-9.2 2.9-18.7 3.9-28.1 3.9-75.1 0.2-150.2 0.3-225.4 0-16.5-0.1-31.4-5.4-43-18.1-8.8-9.7-12.3-21.5-14.3-34-0.3-1.9 0.4-4.6-2.6-5.2 1.3 0.1 0.9 1.3 0.9 2.1zM191.8 882.7c2.1-0.3 4.3-0.1 6.5-0.1h206c8.4 0 16.6-1 24.7-3.1 25.5-6.6 41.4-26.9 41.5-53.2 0.1-25.3 0-50.7 0-76v-148c0-32.3-21.4-56.2-53.6-59.7-11.4-1.2-22.9-1.7-34.4-2-34.5-0.7-69 0.5-103.4 1.3-33 0.8-66 0.2-98.9 0.7-11.5 0.2-22.6 2.7-32.7 8.1-13.6 7.2-21.9 18.5-25.7 33.4-0.7 2.8-0.1 6.5-3.7 8v234c2 5.5 2.2 11.4 3.9 17.1 5.9 20.7 19.4 33.3 39.8 38.9 6.5 1.8 13.2 2.3 19.9 2.1 1.4 0 3.3-1.1 4.4 0.9h2c0.2-2.3 2.1-2.2 3.7-2.4z m-11.4-40.6c-12.2 0-20.7-6.6-20.6-20.5 0.4-73.3 0.2-146.6 0.1-220 0-11.8 7-18.1 18.3-18.5 74.6-2.4 149.1-0.5 223.7-0.8 6.4 0 13.4-0.4 19.6 3 5.4 3 8.5 7.2 8.5 13.7-0.1 37.5 0 75 0 112.5 0 37.2-0.2 74.3 0.1 111.5 0.1 12.1-7.8 17.6-18.7 19.3-8.6 1.3-17 0-25.5-0.1-68.5-0.2-137-0.1-205.5-0.1z"
                    p-id="2309"
                  ></path>
                  <path
                    d="M193.5 884.2c67.8-0.1 135.7-0.1 203.5 0 9.4 0 18.7-0.2 28-2.1 12.5-2.5 23.8-7.8 32.5-17.1 9.7-10.4 14.5-23.4 14.5-37.6 0.2-74.3 0.1-148.7 0.1-223 0-6.3-0.4-12.4-2-18.5-5.3-19.9-17.3-33.7-36.7-41.3-13.3-5.2-27.3-5-41-5.3-23.1-0.5-46.2-0.9-69.3 0.5-19 1.2-38.2 0.3-57.3 1-27.6 0.9-55.3 0.3-83 0.2-6.4 0-12.7 0.6-19 2-18.4 4.2-32.5 13.8-40.6 31.3-2.6 5.7-2.8 12-5.2 17.7 3.7-1.5 3-5.2 3.7-8 3.8-14.9 12.2-26.2 25.7-33.4 10.2-5.4 21.2-7.9 32.7-8.1 33-0.5 65.9 0.1 98.9-0.7 34.5-0.8 68.9-2 103.4-1.3 11.5 0.2 23 0.7 34.4 2 32.2 3.5 53.5 27.4 53.6 59.7v148c0 25.3 0.1 50.7 0 76-0.2 26.4-16 46.6-41.5 53.2-8.1 2.1-16.3 3.1-24.7 3.1h-206c-2.2 0-4.3-0.1-6.5 0.1-1.6 0.2-3.5 0-3.7 2.4 1.5-1.9 3.7-0.8 5.5-0.8z"
                    p-id="2310"
                  ></path>
                  <path
                    d="M143.6 130.9c13-8 27.4-10.6 42.2-10.7 41.1-0.4 82.2-0.1 123.3-0.2 1.6 0 3.6 1.2 4.9-0.9-1.7 1-3.6 0.5-5.4 0.5-44.8 0.3-89.6-0.8-134.4 0.6-18.9 0.6-34.9 8.1-46.5 23.6-6.3 8.4-9.1 18-9.7 28.3 1.8-2.4 1.2-5.4 1.9-8.2 4-13.9 11.2-25.2 23.7-33zM840 120c6.6-0.3 13.1 0.5 19.5 2.1 21 5.4 35.7 17.8 42.8 38.8 1.6 4.8 1.8 9.9 3.3 14.7v-0.4c0.4-28.1-24.4-53.2-52.7-55.3-5.6-0.4-11.2 0.5-16.8-0.9 0.8 2.1 2.6 1.1 3.9 1zM181.6 884.2c-6.7 0.2-13.4-0.3-19.9-2.1-20.4-5.6-33.9-18.2-39.8-38.9-1.6-5.7-1.8-11.6-3.9-17.1 1.1 5.3 0.8 10.8 2.1 16.1 5.5 22.8 25.5 40.6 48.6 42 5.8 0.4 11.6-0.6 17.3 0.8-1.1-1.9-3-0.9-4.4-0.8z"
                    p-id="2311"
                  ></path>
                  <path
                    d="M608.4 667.2c-12.3 0.2-20.4 8.3-20.4 20V859c0 12.3 8.5 20.1 20.8 19.9 12.9-0.2 21-6.9 21.1-19.7 0.2-57.4 0.1-114.9 0-172.3 0-12-8.4-19.9-21.5-19.7zM861.4 667.4c-9.9-1.8-23.3 4.9-23.3 18.2-0.2 29.2 0 58.3 0 87.5v87c0 1.6-0.1 3.4 0.4 4.9 3.3 9.4 14.4 16.2 23.5 14 11.4-2.7 17.9-7.2 18-21.4 0.2-55.5 0.1-111 0.1-166.5-0.1-14.4-4.6-21.1-18.7-23.7zM768.7 727.3c-2.6-9.4-13-16.8-22.1-15.1-12.4 2.4-19.4 6.6-19.5 20.9-0.3 41.1-0.1 82.3-0.1 123.4 0 13.8 5.7 20 17.5 22.2 11.1 2.1 24.4-4.5 24.5-19.1v-63.5-64.5c0-1.3 0-2.9-0.3-4.3zM741 544.8c-8.7 1.9-14 10.2-14 19.8V653c0 13.1 4 21 18.1 23.7 10.3 1.9 24-5.2 23.9-18.5-0.1-15.8 0-31.6 0-47.5 0-15.3-0.2-30.6 0-46 0.3-19-14.6-22.8-28-19.9zM622 547.4c-4.9-3.4-10.1-3.3-15.4-3.3-10.5 0-18.5 7.9-18.5 18.3v26c0 9-0.1 18 0 27 0.1 4.6 1.3 8.7 4.9 12.3 5.2 5.2 11.2 6.7 18.2 6.5 9.9-0.3 18.8-8.9 18.8-18.7 0.1-17.7 0.2-35.3-0.1-53 0-6.1-2.4-11.3-7.9-15.1zM878.3 555.9c-2.2-6.2-9.8-11.8-17.9-12-14.3-0.5-23.6 7.9-22.5 22.8 0.5 7 0.1 14 0.1 21v25c0 1.5 0 3 0.4 4.4 3.2 10.3 12.9 15.5 23.9 14 11-1.6 17.4-8.4 17.6-19.7 0.3-15.8 0.1-31.7 0.1-47.5 0-2.9-0.8-5.5-1.7-8zM352 257.8c-1.9-7.3-7.9-12.7-15.4-13.7-1.3-0.2-2.7-0.4-4-0.4-0.6 0-1.5 0.2-1.7-0.8h-28.8c-0.4 0.7-1.1 0.3-1.6 0.3-13.3 0-26.6-0.1-39.9 0.1-4.8 0-9.5 0.9-13.7 3.5-4.1 2.5-6.4 6.2-7.7 10.7-0.2 0.9 0 1.9-0.6 2.6v75.5c1 0.2 0.7 1.1 0.8 1.7 0.7 4.1 1.8 7.9 4.6 11 3.7 4.1 8.6 5.8 13.9 5.9 24.3 0.1 48.7 0.1 73 0 3.1 0 6.1-0.3 9.1-1.3 7.9-2.5 12.7-8.9 12.7-17.2v-71.9c0.1-2-0.2-4-0.7-6zM785.5 250.1c-1.9-7.3-7.9-12.7-15.4-13.7-1.3-0.2-2.7-0.4-4-0.4-0.6 0-1.5 0.2-1.7-0.8h-28.8c-0.4 0.7-1.1 0.3-1.6 0.3-13.3 0-26.6-0.1-39.9 0.1-4.8 0-9.5 0.9-13.7 3.5-4.1 2.5-6.4 6.2-7.7 10.7-0.2 0.9 0 1.9-0.6 2.6v75.5c1 0.2 0.7 1.1 0.8 1.7 0.7 4.1 1.8 7.9 4.6 11 3.7 4.1 8.6 5.8 13.9 5.9 24.3 0.1 48.7 0.1 73 0 3.1 0 6.1-0.3 9.1-1.3 7.9-2.5 12.7-8.9 12.7-17.2v-71.9c0.2-2-0.2-4.1-0.7-6zM351.4 676.6c-1.9-7.3-7.9-12.7-15.4-13.7-1.3-0.2-2.7-0.4-4-0.4-0.6 0-1.5 0.2-1.7-0.8h-28.8c-0.4 0.7-1.1 0.3-1.6 0.3-13.3 0-26.6-0.1-39.9 0.1-4.8 0-9.5 0.9-13.7 3.5-4.1 2.5-6.4 6.2-7.7 10.7-0.2 0.9 0 1.9-0.6 2.6v75.5c1 0.2 0.7 1.1 0.8 1.7 0.7 4.1 1.8 7.9 4.6 11 3.7 4.1 8.6 5.8 13.9 5.9 24.3 0.1 48.7 0.1 73 0 3.1 0 6.1-0.3 9.1-1.3 7.9-2.5 12.7-8.9 12.7-17.2v-71.9c0.1-2-0.2-4-0.7-6z"
                    p-id="2312"
                  ></path>
                </svg>
                二维码
              </div>
              <div
                class="post-reward-btn post-end-tool-btn-item"
                onclick="showplane('.post-reward-btn','#reward-plane',event)"
              >
                <!--?xml version="1.0" standalone="no"?-->
                <svg
                  t="1611304985070"
                  class="icon"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="2030"
                  xmlns:xlink="http://www.w3.org/1999/xlink"
                  width="200"
                  height="200"
                >
                  <defs></defs>
                  <path
                    d="M511.413646 65.750493c-247.232824 0-447.682136 200.421682-447.682136 447.682136S264.180821 961.115787 511.413646 961.115787s447.682136-200.421682 447.682136-447.682136S758.645446 65.750493 511.413646 65.750493zM511.413646 905.155265c-216.298278 0-391.721613-175.396729-391.721613-391.721613s175.423335-391.721613 391.721613-391.721613c216.353536 0 391.721613 175.396729 391.721613 391.721613S727.766159 905.155265 511.413646 905.155265z"
                    p-id="2031"
                  ></path>
                  <path
                    d="M526.387685 472.448192c-10.92891 10.956539-28.635177 10.956539-39.569204 0L328.557014 314.186725c-10.92891-10.956539-10.92891-28.640294 0-39.569204l0 0c10.92891-10.956539 28.635177-10.956539 39.569204 0l158.261467 158.261467C537.316595 443.813015 537.316595 461.519282 526.387685 472.448192L526.387685 472.448192z"
                    p-id="2032"
                  ></path>
                  <path
                    d="M496.437559 472.448192c-10.92891-10.92891-10.92891-28.635177 0-39.569204L654.699026 274.617521c10.93505-10.92891 28.640294-10.92891 39.569204 0l0 0c10.92891 10.92891 10.92891 28.635177 0 39.569204L536.006763 472.448192C525.072737 483.377102 507.36647 483.377102 496.437559 472.448192L496.437559 472.448192z"
                    p-id="2033"
                  ></path>
                  <path
                    d="M735.254713 485.453391c0 15.467273-12.512988 27.980261-27.980261 27.980261l-391.721613 0c-15.468296 0-27.980261-12.512988-27.980261-27.980261l0 0c0-15.467273 12.511965-27.980261 27.980261-27.980261l391.721613 0C722.740702 457.473129 735.254713 469.986117 735.254713 485.453391L735.254713 485.453391z"
                    p-id="2034"
                  ></path>
                  <path
                    d="M735.254713 597.373413c0 15.467273-12.512988 27.980261-27.980261 27.980261l-391.721613 0c-15.468296 0-27.980261-12.512988-27.980261-27.980261l0 0c0-15.467273 12.511965-27.980261 27.980261-27.980261l391.721613 0C722.740702 569.393151 735.254713 581.90614 735.254713 597.373413L735.254713 597.373413z"
                    p-id="2035"
                  ></path>
                  <path
                    d="M539.392884 765.254981c0 15.467273-12.512988 27.980261-27.980261 27.980261l0 0c-15.468296 0-27.980261-12.512988-27.980261-27.980261L483.432361 485.453391c0-15.467273 12.511965-27.980261 27.980261-27.980261l0 0c15.467273 0 27.980261 12.512988 27.980261 27.980261L539.392884 765.254981z"
                    p-id="2036"
                  ></path>
                </svg>
                打赏
              </div>
              <div id="share-plane" class="post-pop-plane">
                <div class="post-share-list">
                  <a
                    href="https://connect.qq.com/widget/shareqq/index.html?url=https://www.1kmb.com/note/273.html&amp;title=RBAC权限系统分析、设计与实现&amp;source=MaxPHP&amp;desc=&amp;pics=&amp;summary=目前，使用最普遍的权限管理模型正是RBAC（Role-Based Access Control）模型，这篇文章也主要是介绍基于RBAC的权限管理系统，我会从RBAC是什么、如何设计RBAC两部分来介绍。"
                    target="_blank"
                  >
                    <svg
                      t="1599120943195"
                      name="share-qq"
                      class="share-icon"
                      viewBox="0 0 1024 1024"
                      version="1.1"
                      xmlns="http://www.w3.org/2000/svg"
                      p-id="3139"
                      width="200"
                      height="200"
                    >
                      <path
                        d="M511.09761 957.257c-80.159 0-153.737-25.019-201.11-62.386-24.057 6.702-54.831 17.489-74.252 30.864-16.617 11.439-14.546 23.106-11.55 27.816 13.15 20.689 225.583 13.211 286.912 6.767v-3.061z"
                        fill="#FAAD08"
                        p-id="3140"
                      ></path>
                      <path
                        d="M496.65061 957.257c80.157 0 153.737-25.019 201.11-62.386 24.057 6.702 54.83 17.489 74.253 30.864 16.616 11.439 14.543 23.106 11.55 27.816-13.15 20.689-225.584 13.211-286.914 6.767v-3.061z"
                        fill="#FAAD08"
                        p-id="3141"
                      ></path>
                      <path
                        d="M497.12861 474.524c131.934-0.876 237.669-25.783 273.497-35.34 8.541-2.28 13.11-6.364 13.11-6.364 0.03-1.172 0.542-20.952 0.542-31.155C784.27761 229.833 701.12561 57.173 496.64061 57.162 292.15661 57.173 209.00061 229.832 209.00061 401.665c0 10.203 0.516 29.983 0.547 31.155 0 0 3.717 3.821 10.529 5.67 33.078 8.98 140.803 35.139 276.08 36.034h0.972z"
                        fill="#000000"
                        p-id="3142"
                      ></path>
                      <path
                        d="M860.28261 619.782c-8.12-26.086-19.204-56.506-30.427-85.72 0 0-6.456-0.795-9.718 0.148-100.71 29.205-222.773 47.818-315.792 46.695h-0.962C410.88561 582.017 289.65061 563.617 189.27961 534.698 185.44461 533.595 177.87261 534.063 177.87261 534.063 166.64961 563.276 155.56661 593.696 147.44761 619.782 108.72961 744.168 121.27261 795.644 130.82461 796.798c20.496 2.474 79.78-93.637 79.78-93.637 0 97.66 88.324 247.617 290.576 248.996a718.01 718.01 0 0 1 5.367 0C708.80161 950.778 797.12261 800.822 797.12261 703.162c0 0 59.284 96.111 79.783 93.637 9.55-1.154 22.093-52.63-16.623-177.017"
                        fill="#000000"
                        p-id="3143"
                      ></path>
                      <path
                        d="M434.38261 316.917c-27.9 1.24-51.745-30.106-53.24-69.956-1.518-39.877 19.858-73.207 47.764-74.454 27.875-1.224 51.703 30.109 53.218 69.974 1.527 39.877-19.853 73.2-47.742 74.436m206.67-69.956c-1.494 39.85-25.34 71.194-53.24 69.956-27.888-1.238-49.269-34.559-47.742-74.435 1.513-39.868 25.341-71.201 53.216-69.974 27.909 1.247 49.285 34.576 47.767 74.453"
                        fill="#FFFFFF"
                        p-id="3144"
                      ></path>
                      <path
                        d="M683.94261 368.627c-7.323-17.609-81.062-37.227-172.353-37.227h-0.98c-91.29 0-165.031 19.618-172.352 37.227a6.244 6.244 0 0 0-0.535 2.505c0 1.269 0.393 2.414 1.006 3.386 6.168 9.765 88.054 58.018 171.882 58.018h0.98c83.827 0 165.71-48.25 171.881-58.016a6.352 6.352 0 0 0 1.002-3.395c0-0.897-0.2-1.736-0.531-2.498"
                        fill="#FAAD08"
                        p-id="3145"
                      ></path>
                      <path
                        d="M467.63161 256.377c1.26 15.886-7.377 30-19.266 31.542-11.907 1.544-22.569-10.083-23.836-25.978-1.243-15.895 7.381-30.008 19.25-31.538 11.927-1.549 22.607 10.088 23.852 25.974m73.097 7.935c2.533-4.118 19.827-25.77 55.62-17.886 9.401 2.07 13.75 5.116 14.668 6.316 1.355 1.77 1.726 4.29 0.352 7.684-2.722 6.725-8.338 6.542-11.454 5.226-2.01-0.85-26.94-15.889-49.905 6.553-1.579 1.545-4.405 2.074-7.085 0.242-2.678-1.834-3.786-5.553-2.196-8.135"
                        fill="#000000"
                        p-id="3146"
                      ></path>
                      <path
                        d="M504.33261 584.495h-0.967c-63.568 0.752-140.646-7.504-215.286-21.92-6.391 36.262-10.25 81.838-6.936 136.196 8.37 137.384 91.62 223.736 220.118 224.996H506.48461c128.498-1.26 211.748-87.612 220.12-224.996 3.314-54.362-0.547-99.938-6.94-136.203-74.654 14.423-151.745 22.684-215.332 21.927"
                        fill="#FFFFFF"
                        p-id="3147"
                      ></path>
                      <path
                        d="M323.27461 577.016v137.468s64.957 12.705 130.031 3.91V591.59c-41.225-2.262-85.688-7.304-130.031-14.574"
                        fill="#EB1C26"
                        p-id="3148"
                      ></path>
                      <path
                        d="M788.09761 432.536s-121.98 40.387-283.743 41.539h-0.962c-161.497-1.147-283.328-41.401-283.744-41.539l-40.854 106.952c102.186 32.31 228.837 53.135 324.598 51.926l0.96-0.002c95.768 1.216 222.4-19.61 324.6-51.924l-40.855-106.952z"
                        fill="#EB1C26"
                        p-id="3149"
                      ></path>
                    </svg>
                  </a>
                  <a
                    href="http://sns.qzone.qq.com/cgi-bin/qzshare/cgi_qzshare_onekey?url=https://www.1kmb.com/note/273.html&amp;title=RBAC权限系统分析、设计与实现&amp;pics=&amp;summary=目前，使用最普遍的权限管理模型正是RBAC（Role-Based Access Control）模型，这篇文章也主要是介绍基于RBAC的权限管理系统，我会从RBAC是什么、如何设计RBAC两部分来介绍。"
                    target="_blank"
                  >
                    <svg
                      t="1599121101983"
                      name="share-qzone"
                      class="share-icon"
                      viewBox="0 0 1024 1024"
                      version="1.1"
                      xmlns="http://www.w3.org/2000/svg"
                      p-id="7781"
                      width="200"
                      height="200"
                    >
                      <path
                        d="M504.768 24.224c-5.216 2.144-19.872 17.728-19.872 21.28 0 1.184-22.944 49.888-51.072 108.064S381.568 262.56 380.16 266.592c-1.184 3.776-3.328 8.288-4.256 9.696-1.184 1.408-7.808 14.176-14.88 28.384-7.552 15.616-15.616 28.608-20.096 32.16-10.88 9.216-3.552 8.288-221.312 32.64C21.248 380.576 10.368 382.24 4.48 387.68c-4.256 3.776-5.92 17.504-2.848 25.536 0.96 2.112 43.264 42.336 94.112 89.376 160.768 148.48 150.368 138.08 150.368 149.184 0 5.44-3.296 25.056-7.104 43.968-4.032 18.912-12.992 66.208-20.32 105.216s-15.84 83.712-18.912 99.296c-16.32 83.232-16.544 85.6-8.032 94.592 8.032 8.512 17.248 7.552 41.6-4.736 22.688-11.584 24.832-12.768 69.504-39.008 16.32-9.472 37.6-21.76 47.296-27.2s27.648-16.064 39.712-23.392 22.464-13.248 23.168-13.248c0.48 0 7.808-4.256 16.064-9.472s15.84-9.44 16.8-9.44c0.96 0 9.472-4.736 18.912-10.624 22.464-13.952 41.856-21.056 52.96-18.912 4.736 0.96 16.064 5.44 25.056 10.4 23.648 12.544 172.608 98.368 218.944 126.016 39.488 23.648 51.072 28.128 64.544 24.576 8.992-2.144 11.584-15.136 8.512-40.896-1.408-11.584-3.552-24.608-4.736-29.088-1.888-7.552-9.696-49.408-28.608-154.4-8.736-49.888-8.736-50.848 10.88-58.176 27.2-10.176 39.968-19.136 35.008-24.128-1.664-1.664-16.8 0.256-48.224 5.92-58.4 10.624-70.464 12.288-132.16 17.984-70.208 6.624-135.008 8.032-221.568 4.96-67.616-2.368-148-8.288-152.512-11.104-3.552-2.368-1.888-9.696 3.552-14.432 2.848-2.592 38.784-28.384 79.68-57.44 128.16-90.784 211.392-150.848 218.24-157.248 11.808-11.104 10.88-11.584-38.304-17.984-77.792-9.92-98.112-11.584-224.864-17.504-42.336-1.888-80.64-4.256-85.12-4.96-46.336-7.808 189.856-29.088 289.632-26.016 65.504 1.888 142.592 7.328 187.968 13.248 42.336 5.664 44.928 6.144 44.928 10.88 0 3.776-4.48 7.104-104.032 75.648-40.896 28.384-84.416 58.4-96.704 66.912-12.064 8.512-24.576 17.248-27.424 19.136-13.248 8.992-57.696 39.968-69.984 48.928-7.808 5.664-13.952 11.808-13.952 13.728 0 4.48 11.584 7.328 47.296 11.584 94.816 11.104 271.2 17.248 279.008 9.472 1.664-1.664 1.408-6.848-1.184-17.728-1.888-8.288-3.552-16.096-3.552-17.248 0-3.328 40.192-43.52 95.744-95.52 146.816-137.6 150.144-140.928 150.144-151.808 0-9.472-7.808-17.984-19.392-20.8-5.664-1.408-39.488-5.216-75.2-8.736-35.712-3.328-75.2-7.104-87.488-8.288-12.288-1.408-38.304-4.032-57.92-6.144-74.944-7.552-97.888-10.4-103.328-12.992-10.4-4.736-20.096-24.128-91.744-185.376C537.824 44.8 533.344 35.584 526.24 29.216c-5.888-5.44-15.104-7.552-21.504-4.96z"
                        fill="#FFCE00"
                        p-id="7782"
                      ></path>
                    </svg>
                  </a>
                  <a
                    href="https://service.weibo.com/share/share.php?url=https://www.1kmb.com/note/273.html&amp;title=RBAC权限系统分析、设计与实现"
                    target="_blank"
                  >
                    <svg
                      t="1599121004264"
                      name="share-weibo"
                      class="share-icon"
                      viewBox="0 0 1024 1024"
                      version="1.1"
                      xmlns="http://www.w3.org/2000/svg"
                      p-id="4523"
                      width="200"
                      height="200"
                    >
                      <path
                        d="M851.4 590.193c-22.196-66.233-90.385-90.422-105.912-91.863-15.523-1.442-29.593-9.94-19.295-27.505 10.302-17.566 29.304-68.684-7.248-104.681-36.564-36.14-116.512-22.462-173.094 0.866-56.434 23.327-53.39 7.055-51.65-8.925 1.89-16.848 32.355-111.02-60.791-122.395C311.395 220.86 154.85 370.754 99.572 457.15 16 587.607 29.208 675.873 29.208 675.873h0.58c10.009 121.819 190.787 218.869 412.328 218.869 190.5 0 350.961-71.853 398.402-169.478 0 0 0.143-0.433 0.575-1.156 4.938-10.506 8.71-21.168 11.035-32.254 6.668-26.205 11.755-64.215-0.728-101.66z m-436.7 251.27c-157.71 0-285.674-84.095-285.674-187.768 0-103.671 127.82-187.76 285.674-187.76 157.705 0 285.673 84.089 285.673 187.76 0 103.815-127.968 187.768-285.673 187.768z"
                        fill="#E71F19"
                        p-id="4524"
                      ></path>
                      <path
                        d="M803.096 425.327c2.896 1.298 5.945 1.869 8.994 1.869 8.993 0 17.7-5.328 21.323-14.112 5.95-13.964 8.993-28.793 8.993-44.205 0-62.488-51.208-113.321-114.181-113.321-15.379 0-30.32 3.022-44.396 8.926-11.755 4.896-17.263 18.432-12.335 30.24 4.933 11.662 18.572 17.134 30.465 12.238 8.419-3.46 17.268-5.33 26.41-5.33 37.431 0 67.752 30.241 67.752 67.247 0 9.068-1.735 17.857-5.369 26.202a22.832 22.832 0 0 0 12.335 30.236l0.01 0.01z"
                        fill="#F5AA15"
                        p-id="4525"
                      ></path>
                      <path
                        d="M726.922 114.157c-25.969 0-51.65 3.744-76.315 10.942-18.423 5.472-28.868 24.622-23.5 42.91 5.509 18.29 24.804 28.657 43.237 23.329a201.888 201.888 0 0 1 56.578-8.064c109.253 0 198.189 88.271 198.189 196.696 0 19.436-2.905 38.729-8.419 57.16-5.508 18.289 4.79 37.588 23.212 43.053 3.342 1.014 6.817 1.442 10.159 1.442 14.943 0 28.725-9.648 33.37-24.48 7.547-24.906 11.462-50.826 11.462-77.175-0.143-146.588-120.278-265.813-267.973-265.813z"
                        fill="#F5AA15"
                        p-id="4526"
                      ></path>
                      <path
                        d="M388.294 534.47c-84.151 0-152.34 59.178-152.34 132.334 0 73.141 68.189 132.328 152.34 132.328 84.148 0 152.337-59.182 152.337-132.328 0-73.15-68.19-132.334-152.337-132.334zM338.53 752.763c-29.454 0-53.39-23.755-53.39-52.987 0-29.228 23.941-52.989 53.39-52.989 29.453 0 53.39 23.76 53.39 52.989 0 29.227-23.937 52.987-53.39 52.987z m99.82-95.465c-6.382 11.086-19.296 15.696-28.726 10.219-9.43-5.323-11.75-18.717-5.37-29.803 6.386-11.09 19.297-15.7 28.725-10.224 9.43 5.472 11.755 18.864 5.37 29.808z"
                        fill="#040000"
                        p-id="4527"
                      ></path>
                    </svg>
                  </a>
                </div>
              </div>
              <div id="qrcode-plane" class="post-pop-plane">
                <div id="qrcode-img" title="https://www.1kmb.com/note/273.html">
                  <canvas
                    width="256"
                    height="256"
                    style="display: none"
                  ></canvas>
                  <canvas
                    width="256"
                    height="256"
                    style="display: none"
                  ></canvas
                  ><img
                    style="display: block"
                    src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAQAAAAEACAYAAABccqhmAAAAAXNSR0IArs4c6QAAF3ZJREFUeF7tneF22zoMg9f3f+jdk97TdJ0tUfxMMHKG/rUokSAIUXKSfvz69ev3rxv//f5d7/7Hx0cpIjMfZ2vR2LrnLAVrs8lo7jYLY+jOg+n1FdQYPS2SmYsWgCM61Zg0UuTSUhaAS/DpjS0AuWKleFkAcjjrmV+zgjuAExyryU53EUWxKuasoeKes9Dc7RnNiYj5CKBXdkoiRbEq5rwL2YmfNHdkrVfYuANwB7DEu+quaGnRDQb9swJAdwpFzuittoK0nYToXOuRN7oetZtxhfBPwRMaG/FfUTuPOWe4DDuAuwRAE0TB7lyvcy0LwDkjaA7uUj8WgKQSUEIkl/kc3rnWlfUUfpICcgdwzjJ3AKT6BjYKso/c61zLAuAO4AcCRIEL6+zHVAplp752FmXnWhYAC4AFYEEVOouycy0LgAXAAmABGCLQ3YWRDlThIxVh4v8C/dCQ8juAnV6vUaApWUgGKF4K8tG4qR3Ba/bq6h0woXyYYUlxQW8BdgrAAnCkBSWDws4CcERgp/qxAJwwlIrKiOw04YqCpDs5tbMAWACWOKAg+2zhTkJbAJYosPTmR8ETygWFXR6p/y0oLu4A3AE8EaAkqu6YfAeQlwGaOwuABcACMPkFKFpY1C5f+u4AEGa0fSOL+QiQR22EGS2su9jlkbIAIMyoAFA74mTnWrO2O/JdcQQgF6q0yGfx0TmpXYT16Dldz0eA5BGgsyg717IAnJcWLSxqZwE4QUBRCHROakcS27mWBcAC8AOBuygYbT9pcVE7CwBB4GhD8b/LPQxFidarjwA+AjwRUBQJJbTvAHLIWQByeE1/JomCSbuRarInobAATABTcIEKreKy0h2AOwALgAXgiABVPrr70PWqd93oMoz6SXEhdgofu3Eexb1TbN33Ee4Akrs1KR4LQP42XIGzBSCHKhXGf/YIMIN3J2XP0eD/0ZQMdIchPkZCawHIoUpzbgE4wdkCkDsS5qj6PZpchlGiK8RtJ55QXCwAFoCl+vUdwBEmC8ASddYGUQXrJib1cw2FmlEKH7tx9hEgxwWac3cA7gCWmGYBcAewRBTFoJ1areqzJDkHX8GY7hRUAKrjo350X/oq/KR5n+UAdQDUEWpnAaDI5S7zKM60uEhUisKicVM7EvcVGwvAFfQStoSc1Ttk5K47gJ5WnnAhyh19bgGgyCXtSNItADmQCcbRCnQnp3aRP9XPLQDViA7mI+S0AOSSQzCOVqCFTO0if6qfWwCqEbUALCNaLXAWgGXonwMtAHnMkAUhZ3WBRI77DsB3AH8iMHwLEBFpl+cKQtPWbmR3Bx8f+byDn3fwcZfaWPHDAnCCkgXg9bvk3cV0pfh2GGMBsAA8EbjD7noHH3co7FUfLAAWAAuA4D8DrRbgq8dZACwAFgALwKt1iK9/h5bwDj76EvCcgzR3nNG9lu4A3AG4A/iXO4Df5OV1r0jh1apv8+kuqYCYfn5AsaMp4hslneYUk+jNDT8sAPpXXooCsQAc86bA+c3r/5cF4MVHAEowC4AFgHLnTzsLgAXgiYBCVCpI+oOw8Lxe7ce7zGcBsABYAN6lmkEcFgALgAUAFM67mFgALAAWgHepZhBHqwDQMyaI69NEcSt8h9dQCpzp68NqO4o/xYT6P+PsTry0ACTVhRIwucyl4ZTslLQUE2JHbB5xUUwsAJeo+NOYJoG6sJPS0hiInQJnWgjVdhaAc0ZgXDo/CKQgJt21SGFFO4lCcIifCpyrC5liiYk+eX1IOURxVvAE42IByJUYBTq3yrXRlJiKQqgWDoo/xYT6T7Gkmce4WABykFOgc6tcG03JTklLMSF2xCbqNhRx0zlp5jEuFoAc5BTo3CrXRlsAjvhRTP7ZDoACdo2659bdSaBFTjBTxEZ3n864Hz6S2IlNtBblLMVrth7h0JX4hq8BqSMUTAVpFXNSAo58qZ4vwp+uR+2qc0D92OnizQIQsfSv5zTp1eSLlJaIpiK2O8RNsaR4WQDOWeEO4AQX2tpZAHLKToqZ2ERik/P6ezTliTuAJOI06XfYCRWx3SHuqChHxUXxcgfgDuAHAgoiuQPIKTvJAbGJxCbntTsAihe2o0m/w06oiO0OcUdF6Q4gVy60w0G/CowXgx/HzEHxPZr6Sder7gA6/YjWUgiVYs4ojrPn1A/KL8KTKC7sy+N1bDT538/xYhaAA9QUS8VFkqJz6J4zy2XaiUR2O+Vn6osFgFBmcKECBM4CUIclzaQ7gCRylLSK1ofuMMmQl4aT+CiWO+0wJO5oB6VzLiXqr0EWgCRqlLSdSY0Ilgx5aTiJj2JpAVhKydIgC8ASTN+DKGlJgSRd+zGc+knXJPEpfCR+RDHTIqEdmiKGkS80Npo7RWzYF98BRNRff04SSxPnDmA9L9HIf1oAyNeBFR+BjJI0ek6KLjoe0DlJDFQAqI8Ksiv4UP05AJKbyIZiGc3b+Rz9KKgi4TTo7kKgfpL2U7HLU9Iq7Eh81I/qvO20iVyJzQJwgh4VFZIIdwDnqLkDIGzK21gALABPBGhnR+3cAeQLttrCAmABsADAqtrpOAJDYP8eXKH4OADw6budzm8+AvgIQLlfYecOwB2AOwBYSW/RAXR+DgDijP+tE12vOrGKXb7axwgrxXoUl8jX7PPOS9+o+8z6/jWeduWtXwdWBEfnnNlVk50SHScVHos6MVEVAuGDBSCJGiV0cpml1pTO2Ul2ipcFQJHd45wWgCTOlNDJZSwAk528ukuJcqNYr5tHoxgtAFH2/3renbidEkR8oXi5A0gSEw4nOYVLfZpRPszWxFzxJeAR1urdjiYcJ9V3AKn6/KcFYPRlIAoKLZ7uIpGo6aDw7oKJQnCq81o9X7QjKzBR3D9hXCwAuUshUszEJiJmp4BFvtAiITFgogvuU2heLQAnCHQnlpCPFgIlSjcmtJCpHcnBO2BiAbAALL3heAeyV8dQPR8V9St2FgALgAUguKYjXwcmHcWVQqadnQXAAmABsACcIkBFBXdGvgT0JeAXAvQsT+3Ijo2J7kvAU7hv8W3AToIFG1PrY8Vu0I2lomCrk9DtI80rjXu63h1+FLSbtBToajtKFIUd2a2j8zWdsxNnhY80PzRuC8AJcvSDTjQJxI4SRWFHC6F7d63GmcatuOgjsUUi7CMARbXBTlHI3d2UBeBIFJpXSjl3AO4AnghYAHIF6Q4gWTxU8SnQdD0fAXoK4Q756fbRHUCyl+netZLuyYZToijs3lmgLQBJCtOCpLsuJXQyrOfwakLQ+RRFR3On8IXmZ2SniI36qPCFzjmza70EtABQOh3tFGSgQkV9qUPj/5l28UPlC43PApBkWnUh0PkUuy4lkcKXZFrC4YrYwkUHAxS+0DktAMks0oKt/gKLougoiRS+JNMSDlfEFi5qAfiJgOK8rphzllgLQI72uxTeLn74CABUkRYkvVeg65GdkAoKWethQwWT+rlL4e3ihwXAAvADAVpYFoB7diJvIQB3UdMcRb5H012SrtdpRwWH5pzaEYGjsVH8uztMxXpTnMnvATgJlE49djQ/tJCpnQXgiIAF4IQVClDcAeTIR/GqFiM6H5Xed+fe8INAClV3EigCOTtaJDTn1M4dQE6EcyxYG20BaOo41tJRM8oCUINjdJlHV6HdFF3PdwAnCOyUhOrEWgDqEPURIFk8ddB/z/TuSajGzAJQh+i7cw99GYic3a6kRLFbd885ir/z/BzlgApHNG/X8+5ipXHt5KcFoPAOgBSQBYCWUc8FGslpFJEFIELor+fduzVNECGLBSBJhslwmreZBySnUUQ7+ekOwB3AEwEF2aNiqHy+U2HtdExGbwFoYrqTQNfr7ip8B0AZtW5HueAOYB3jcGR3Euh6FoBjKt0B9GBCOasQKh8BfATwEWBSWQpR3EoAHl8fP4uf7pAUMAUoYbsCBhBcKCbAvU8TxcWiwhc6Z6cdybfKPwWPPiwAuXQRQigSRy+ZdvIlh/xrRpN8qzxV5M4CkMwWIYQicRaAZOLgcJJvuFRopuCRBSCE/ecAQghF4iwAycTB4STfcKnQTMEjC0AIuwUgCdGP4Xe52xnFaAE4QUZxyXQXohBCKJTbHcAVWVq3Jflenz03UsEjdwC5HKBf3FUkzgKQTBwc/vYCMPpNQIjXVq+gaAzUjnQxlGDUbhabQqhotziyU/ioyLciP9TP6WZhAaiD1QJwxNICkMOkjo1rM7V+EnAn9V6DJzfKApAjO9kld+JQtbjl2FYz2gJQg+PnLBYAC8AXAkTcCqm4PJUFYBmqeKAFwAJgAfh4vFg4/9upfYvLOT/CAmABsABYAFLKQVtFajdzTiHQ1edkhY+phP0xuDo26scVu/IjwMyZbsB2IgtJkgIvKhzUjsT9sKnOHcVSwWc6JxXvWewWAMrQBjtK2p3sKEwWgBxyVKAtADmcW0fvVMiUYBQwC0AOOZofC0AO59bRFoA6uCmWtF2nAkYukqMjk48AdTxqnYmSdic7ChgtoNF6FBMLAM3giR1NgkIVC8OSTaXAi7aK1I6CYwHIIUfz4yNADufW0RaAOrgplm/fAdzhNwGputFdpJos3R0MXY++ZqJFQtbrjq2aC4+Yu2OY5scCcISnOuk04QoBo3tqty+j9SiWRGyiYu3GhMZgAUiy3gJwBKyb7BaAHGlxftwBuANYoRom2OSj4WRHcwdwjhrOjwXAAmABOP3fOJ+wVHeD0ZwruTgbYwE4QQWDUvyFJrprKfxvJ5g7gAPklA+kY4ryfYsfBfVbgCiNP59vRTALwN4CMPpNQNr6KMiXo//a6G5RWfOqZhTNgaLjqJ6zer4riFNfrqxZbTv8IJAFoPaypTpx01c7xbtu5DvlComBFh0VRUXbHeHZ+dwCcIK2gtCtSbUAbN12d3IhWssCYAF4IqDYXavnrJ4vKhB3AMnbdUWrdSVJI1vfARyRURRX9ZzV813hFvXlyprVtu4A3AG4A4BVZQFIFg/EWWLmDsAdwFVivbUAUHDoBdpOdvTcN4phJ7GhOFM+dNrR2KgdeYvxsKHCIfFzl/8NSINT2FkAOsu2bi0FF7Yq1uJPqD6QL/9BkO4kKNazANQVZedMCi5YAJIZ7E6CYj0LQDLpmwxXcMECkExudxIU61kAkknfZLiCCxaAZHK7k6BYzwKQTPomwxVcsAAkk9udBMV6FoBk0jcZruDC2wvA6AdBFDmlr8OoLzR59PUO9XNkR/GidtX+R6+8SMEqPmlKeUL8/7x5h9/VoPmZ8sECkIO1M3m0kKldDom10dSXkZ0CfwvAWi4vj6JkoAvTxLoDoIgf7WjOLQBNOXAHkANasQP5CLAuHAr86UbhI0CudqYfgdwpse4AkomdDHcHcARHwXV8ce0OIEf2zuRVF892F1Dgo60K/N0BnNQABSVXTtrRlCy08Eg0FGcaG90paFfUGV/nWiTXShscO/m/AMpAKuemRWIByGWBnoWpqJA7k+q1cgjpR1sATjC2AOSIh0kEWvnIM5I7hf+Rn7s8x7G7A1i/gVacoXHiBB8mUfiimNMdQI6z0+7HApADk+xM3eduuispilUxpwUgx1kLQLIifAeQA8x3ADm8FKOx0LoDyKmpO4AjXhYARUnn5sQCQH4SjBYBdhJeMlE/c9B/jybxUR9pl0J8vHL3Qf2kOSDHg51yoBDT6RHAAlBHNVJcO5FvShR46WgBqOswCb8idqPfBFSQlpJvF4I9/CcJUmCp2EW6/YyIm32u4AmdU2GXxeNrvAWAIndiZwGo2+0K0/I5FS26mR90ToUdxcsCQJGzACwhR8m+NHlikMIPOqfCLgHFj6EWAIqcBWAJOUr2pckTgxR+0DkVdgkoLAAUrMjORwAfAZ5na8GbK8KviLOtHUDkzOg5Vczu8xuNj9jRiz5qN/ORzkntRr5UzxflpXu9yB+CiwXgBLU7JJb6SO0sAEcEFFjSIqf5sQBYAJ4I0BaTFgK1IzsdjY0WlmI9Kg4znC0AFgALAKysagGDboRmFoATiOi9wi7KTslH7RQ7YbUv1fNFldW9XuQP6YzcAbgDcAcAK8sCAIHLmtHderYOndMdQN1lWHUBVc8X8bR7vcgf1AGQXwVWFA/9rDkt8s6WVoGXggwUS5o7ggsVYOojxZnaKeKb4mwB0O9ohOgPrygZqLhZAGjZ1tnRnNNu5MMCYAFYoS8VsWpRURTISvxdYxTxuQNIZg+r6eDjn7R4KBncAeREPUkP6XCac8xZdwA5spBiJjY+Ajya0+OfokCkFZ2cXBGfO4BkErCaugNIIU2EUVEgKafFgxXxWQCSSbMA5HZeesNuAcjhTI92U5zJbwIm6+llw2khVwNN/VDY0Us5mkSFOBBfdvHj4bvCF8wVC0COTgRoYhMRheyeUaS0/aSC2SlGiqKL8Bw9V/iCOWYByKWRAE1sLAC/c4kJRiuKjjqo8AVzzAKQSyMBmthYACwAfzOTdn2+AzipcdrukmImNhYAC4AFILc5H0bTwqNn2pGoUD8Udp3n7kjEOn1RtN2UngpfMFd8BMilkQBNbKLioe1gZ9FFMXT6oii6HHO+Ryt8wRwjnwSkgSvsFIVA/bxDB9B59OkWAFwEzb/gSwVAIZjoy0C0QBR2FoAjqrQQqo8+FoBzRC0AhUpgAbAAfCFAhW8nO1oauLPzEYBCfrTzESAnRtUt7U6F3L0xWQBO2KRotQhp70JMHwHWRT063lgA6jbW6UzdQFsA6oqEYNktUpRf1I6WjTsAdwBPBGjH0V1cFgBa7jkRnuZ1dAdAFaUupO+ZKKGpnaIQRnN2H1NofhR8ILHfZWdVcIjyeWY3fA2oSDglnyJwGh/1xQJQc0FoAThnEsXFApBUJQtAErDJcHcAuVaecs8dwAkJ3QHkCpniRVvhkR3d6XLRfo/ujpvGR+3cASSZQVXYRwAfAb4QoBxS2FkALABLCHTvhO4AcoLpDuCEMVQxadtKioScg5cqtngQiS1ygcROiR75QgSHzkl5qbBDHQBJXAQWTazCLvK18jnFksY9850WeWcMNG5qV5nrHeeyALw4K53FE4VqAYgQer/nFoAX59QCcJ6AES50J6d2L6aHfHkLgBzi+QIWAAvAKyloAXgl+i/4JxG+A8jdrr+YHvLlLQByiN0BkBt2HwF6iGkB6MF5uIqPAD4CvJKCby0AM2A7C6/7dp0Sil6U0fionyM7xXtyioniqFWN12M+C0ASVUIIWiBUpJIhPYeT2B7GND7qpwWgDjkLQBJLUiS0QCwAueS4A8jh5Q4gj9d0tyMXV4pjCgjr04SIW2RHfSF2FoA8au4AkpiRInEHkAQZDrcA5IGzACQxswAcAaMCl4Q+HG4BCCE6DLAAJDGzAFgAvhCgdzS7CKbvAJLFH513yR0AJRFwPTRREJPuyqGzyQEUZyL4kWsUZ0kM5FeBqSMzYCjQW4E5+CeTNLaISNXPKZb0IlOx3sgXyllF7mjckhgsALkyIoQgNjmvakZTYloAcvhTnC0AJzhvBaY7gOMlE/zX27mSikdLimcSG+12qZjS9XwJGHPnxwiymxObpFslw6mYUtIq1vMR4IjAlH8+AuRqhxQzscl5VTNaUZC+BMwVJBVTdwDJGuhsCS0A58lRCI47gJzgoCNAstYuD+/eReh61a8BqXAoCkshmGS3o7FV5/ThO/WFFoQiBxaAk2xUk0VRyNTHnchnAchlwwJwgpdChWlxuQPItZ8WAAvAEgK0IJcmdwewBJNi97EALEH/HKTIgY8AFoAlFirIZwFYgt4C4A7gSJSdMKGvoCwAFoAlBHYiO7nQIzbRLfNOmFgAlmh8eZCiCxseAS572zRB9yUgITstVppw4mOULuqLQvwiX3d/vhMfLADJOwBSXDslnAqmBaBOVnbigwXAArDEbAvAEkxLgywASzCtDaI7GrmAijwa+bJTwileFoAo++vPd+KDOwB3AEvMtQAswbQ0yAKwBNPaILqjuQNYw/drlAUghxflF700pd65A3AHsMQdC8ASTEuDduoA/gOrivIBZ9rOugAAAABJRU5ErkJggg=="
                  />
                </div>
              </div>
              <div id="reward-plane" class="post-pop-plane">
                <img src="/static/img/pay/wechat.png" alt="" />
                <img src="/static/img/pay/alipay.jpg" alt="" />
              </div>
            </div>
          </div>
          <p
            style="
              text-align: left;
              font-weight: bold;
              color: grey;
              margin: 0.8em;
            "
          >
            <i class="fa fa-link"></i>
            &nbsp;&nbsp;相关推荐
          </p>
          <div class="par-card">
            <div class="card-sm">
              <div
                style="
                  height: 10em;
                  background: white url('/static/bg/bg10.jpg') no-repeat;
                  background-size: cover;
                  border-radius: 5px 5px 0 0;
                "
              ></div>
              <div style="height: 8em; padding: 0.5em; position: relative">
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.95em;
                    font-weight: bold;
                    overflow: hidden;
                    height: 1.2em;
                  "
                >
                  <a style="color: black" href="/note/205.html"
                    >关于版权和开源协议</a
                  >
                </p>
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.85em;
                    color: #808080;
                    height: 4em;
                    overflow: hidden;
                  "
                >
                  相信大家都有在一些软件或者网页的某个角落里看到这样一个词：`Copyright`
                  或者一个`©`的符
                </p>
                <div style="position: absolute; bottom: 1em; margin: 0 0.5em">
                  <i class="fa fa-bars">&nbsp;&nbsp;未分类</i>
                </div>
              </div>
            </div>
            <div class="card-sm">
              <div
                style="
                  height: 10em;
                  background: white
                    url('/upload/thumb/20211115/498445518809f2f7aad04e7fb7dc66c5.jpg')
                    no-repeat;
                  background-size: cover;
                  border-radius: 5px 5px 0 0;
                "
              ></div>
              <div style="height: 8em; padding: 0.5em; position: relative">
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.95em;
                    font-weight: bold;
                    overflow: hidden;
                    height: 1.2em;
                  "
                >
                  <a style="color: black" href="/note/24.html"
                    >Call Stack（调用栈）是什么？</a
                  >
                </p>
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.85em;
                    color: #808080;
                    height: 4em;
                    overflow: hidden;
                  "
                >
                  今天我们来讲一下 call stack 是什么。相信有了上一篇文章对
                  virtual memory
                </p>
                <div style="position: absolute; bottom: 1em; margin: 0 0.5em">
                  <i class="fa fa-bars">&nbsp;&nbsp;未分类</i>
                </div>
              </div>
            </div>
            <div class="card-sm">
              <div
                style="
                  height: 10em;
                  background: white url('/static/bg/bg8.jpg') no-repeat;
                  background-size: cover;
                  border-radius: 5px 5px 0 0;
                "
              ></div>
              <div style="height: 8em; padding: 0.5em; position: relative">
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.95em;
                    font-weight: bold;
                    overflow: hidden;
                    height: 1.2em;
                  "
                >
                  <a style="color: black" href="/note/195.html"
                    >几套好看的美化框CSS</a
                  >
                </p>
                <p
                  style="
                    margin: 0.5em;
                    font-size: 0.85em;
                    color: #808080;
                    height: 4em;
                    overflow: hidden;
                  "
                >
                  &amp;gt; 新技能GET感谢zmki小伙伴 ![](/upload/79af1c468b8467
                </p>
                <div style="position: absolute; bottom: 1em; margin: 0 0.5em">
                  <i class="fa fa-bars">&nbsp;&nbsp;未分类</i>
                </div>
              </div>
            </div>
          </div>
          <div class="card">
            <div
              style="
                border-bottom: 1px solid #e0e0e0;
                display: flex;
                justify-content: space-between;
                padding: 0.5em 1em 1em;
                font-size: 0.95em;
              "
            >
              <b>6条评论</b>
              <a id="sort" data-id="0" href="javascript: void(0)"
                ><span style="color: grey">按时间排序</span></a
              >
            </div>
            <div style="margin: 0.5em">
              <form action="" name="form">
                <input type="hidden" name="comment" value="" />
                <div contenteditable="true" id="comment-field"></div>
                <div
                  style="
                    display: flex;
                    justify-content: space-between;
                    box-sizing: border-box;
                  "
                >
                  <div
                    style="
                      width: 100%;
                      display: flex;
                      justify-content: space-between;
                    "
                  >
                    <input
                      type="text"
                      placeholder="姓名"
                      name="name"
                      class="user-info"
                    />
                    <input
                      type="text"
                      placeholder="邮箱"
                      name="email"
                      class="user-info"
                    />
                    <input
                      type="text"
                      placeholder="网站"
                      name="website"
                      class="user-info"
                    />
                    <input type="hidden" name="note_id" value="273" />
                  </div>
                  <input
                    type="hidden"
                    id="TencentCaptcha"
                    data-appid="2004706694"
                    data-cbfn="callbackName"
                    data-biz-state="data-biz-state"
                  />
                  <div style="width: 6em; text-align: right">
                    <span
                      id="select-meme"
                      style="width: 2.8em; text-align: center; margin: 0 0.3em"
                      ><i
                        style="font-size: 2.1em; color: black; cursor: pointer"
                        class="fa fa-smile-o"
                      ></i
                    ></span>
                    <span
                      id="comment"
                      style="
                        cursor: pointer;
                        line-height: 1.4em;
                        font-size: 1.7em;
                      "
                      class="fa fa-paper-plane-o"
                      aria-hidden="true"
                      title="发送"
                    ></span>
                  </div>
                </div>
                <div id="meme" style="margin-top: 0.5em; display: none">
                  <img
                    src="/static/img/meme/0.png"
                    alt=""
                    title="{汗}"
                    class="meme"
                  /><img
                    src="/static/img/meme/1.png"
                    alt=""
                    title="{囧}"
                    class="meme"
                  /><img
                    src="/static/img/meme/2.png"
                    alt=""
                    title="{斜眼笑}"
                    class="meme"
                  /><img
                    src="/static/img/meme/3.png"
                    alt=""
                    title="{生气}"
                    class="meme"
                  /><img
                    src="/static/img/meme/4.png"
                    alt=""
                    title="{哈欠}"
                    class="meme"
                  /><img
                    src="/static/img/meme/5.png"
                    alt=""
                    title="{滑稽}"
                    class="meme"
                  /><img
                    src="/static/img/meme/6.png"
                    alt=""
                    title="{笑哭}"
                    class="meme"
                  /><img
                    src="/static/img/meme/7.png"
                    alt=""
                    title="{抠鼻}"
                    class="meme"
                  /><img
                    src="/static/img/meme/8.png"
                    alt=""
                    title="{叹气}"
                    class="meme"
                  /><img
                    src="/static/img/meme/9.png"
                    alt=""
                    title="{挨揍}"
                    class="meme"
                  /><img
                    src="/static/img/meme/10.png"
                    alt=""
                    title="{吃瓜}"
                    class="meme"
                  /><img
                    src="/static/img/meme/11.png"
                    alt=""
                    title="{托腮}"
                    class="meme"
                  /><img
                    src="/static/img/meme/12.png"
                    alt=""
                    title="{偷看}"
                    class="meme"
                  /><img
                    src="/static/img/meme/13.png"
                    alt=""
                    title="{吹水}"
                    class="meme"
                  /><img
                    src="/static/img/meme/14.png"
                    alt=""
                    title="{黑线}"
                    class="meme"
                  /><img
                    src="/static/img/meme/15.png"
                    alt=""
                    title="{严肃}"
                    class="meme"
                  /><img
                    src="/static/img/meme/16.png"
                    alt=""
                    title="{鞭炮}"
                    class="meme"
                  /><img
                    src="/static/img/meme/17.png"
                    alt=""
                    title="{打脸}"
                    class="meme"
                  /><img
                    src="/static/img/meme/18.png"
                    alt=""
                    title="{滑稽2}"
                    class="meme"
                  /><img
                    src="/static/img/meme/19.png"
                    alt=""
                    title="{捂嘴}"
                    class="meme"
                  /><img
                    src="/static/img/meme/20.png"
                    alt=""
                    title="{睡觉}"
                    class="meme"
                  /><img
                    src="/static/img/meme/21.png"
                    alt=""
                    title="{挑逗}"
                    class="meme"
                  /><img
                    src="/static/img/meme/22.png"
                    alt=""
                    title="{狗头}"
                    class="meme"
                  /><img
                    src="/static/img/meme/23.png"
                    alt=""
                    title="{上吊}"
                    class="meme"
                  /><img
                    src="/static/img/meme/24.png"
                    alt=""
                    title="{摸头}"
                    class="meme"
                  /><img
                    src="/static/img/meme/25.png"
                    alt=""
                    title="{鸡冻}"
                    class="meme"
                  /><img
                    src="/static/img/meme/26.png"
                    alt=""
                    title="{厉害}"
                    class="meme"
                  />
                </div>
              </form>
              <!--点击此元素会自动激活验证码, 此例使用的button元素, 也可以使用div、span等-->
              <!--id :            (不可变) 元素的 ID, 值必须是 "TencentCaptcha"-->
              <!--data-appid :    (必须) 验证码CaptchaAppId, 从腾讯云的验证码控制台中获取, 验证码控制台页面内【图形验证】>【验证列表】进行查看 。如果未新建验证，请根据业务需求选择适合的验证渠道、验证场景进行新建-->
              <!--data-cbfn :     (必须) 回调函数名, 函数名要与 data-cbfn 相同-->
              <!--data-biz-state :(可选) 业务自定义透传参数, 会在回调函数内获取到 （res.bizState）-->

              <div class="comment-box-list" id="comments">
                <div class="comment-list">
                  <div class="comment-item" id="comment-200">
                    <div class="body">
                      <div class="avatar">
                        <img
                          class="lazyload"
                          src="https://cdn.shopify.com/s/files/1/1493/7144/products/product-image-16756312_1024x1024.jpg?v=1476865937"
                        />
                      </div>
                      <div class="content">
                        <div class="name"><a href="">匿名用户</a></div>
                        <div class="info">
                          <span class="date">23小时前</span>
                          <a href="#respond-post-150" rel="nofollow">回复</a
                          >&nbsp;
                          <a href="#respond-post-150" rel="nofollow">
                            <i
                              class="fa fa-heart-o like"
                              data-id="200"
                              style="cursor: pointer"
                            ></i
                            >&nbsp;<span>2</span>
                          </a>
                        </div>
                        <div class="text">
                          <p>
                            <img src="/static/img/meme/22.png" class="meme" />
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                  <div class="comment-item" id="comment-199">
                    <div class="body">
                      <div class="avatar">
                        <img
                          class="lazyload"
                          src="https://cdn.shopify.com/s/files/1/1493/7144/products/product-image-16756312_1024x1024.jpg?v=1476865937"
                        />
                      </div>
                      <div class="content">
                        <div class="name"><a href="">匿名用户</a></div>
                        <div class="info">
                          <span class="date">23小时前</span>
                          <a href="#respond-post-150" rel="nofollow">回复</a
                          >&nbsp;
                          <a href="#respond-post-150" rel="nofollow">
                            <i
                              class="fa fa-heart-o like"
                              data-id="199"
                              style="cursor: pointer"
                            ></i
                            >&nbsp;<span>1</span>
                          </a>
                        </div>
                        <div class="text">
                          <p>&lt;script&gt;alert('testtest')&lt;/script&gt;</p>
                        </div>
                      </div>
                    </div>
                  </div>
                  <div class="comment-item" id="comment-198">
                    <div class="body">
                      <div class="avatar">
                        <img
                          class="lazyload"
                          src="https://cdn.shopify.com/s/files/1/1493/7144/products/product-image-16756312_1024x1024.jpg?v=1476865937"
                        />
                      </div>
                      <div class="content">
                        <div class="name"><a href="">匿名用户</a></div>
                        <div class="info">
                          <span class="date">23小时前</span>
                          <a href="#respond-post-150" rel="nofollow">回复</a
                          >&nbsp;
                          <a href="#respond-post-150" rel="nofollow">
                            <i
                              class="fa fa-heart-o like"
                              data-id="198"
                              style="cursor: pointer"
                            ></i
                            >&nbsp;<span>1</span>
                          </a>
                        </div>
                        <div class="text">
                          <p>
                            互斥角色
                            ：同一用户只能分配到一组互斥角色集合中至多一个角色，支持责任分离的原则。互斥角色是指各自权限互相制约的两个角色。对于这类角色一个用户在某一次活动中只能被分配其中的一个角色，不能同时获得两个角色的使用权。常举的例子：在审计活动中，一个角色不能同时被指派给会计角色和审计员角色。基数约束
                            ：一个角色被分配的用户数量受限；一个用户可拥有的角色数目受限；同样一个角色对应的访问权限数目也应受限，以控制高级权限在系统中的分配。例如公司的领导人有限的；
                          </p>
                        </div>
                      </div>
                    </div>
                  </div>
                  <div class="comment-item" id="comment-197">
                    <div class="body">
                      <div class="avatar">
                        <img
                          class="lazyload"
                          src="https://cdn.shopify.com/s/files/1/1493/7144/products/product-image-16756312_1024x1024.jpg?v=1476865937"
                        />
                      </div>
                      <div class="content">
                        <div class="name"><a href="">l l</a></div>
                        <div class="info">
                          <span class="date">1天前</span>
                          <a href="#respond-post-150" rel="nofollow">回复</a
                          >&nbsp;
                          <a href="#respond-post-150" rel="nofollow">
                            <i
                              class="fa fa-heart-o like"
                              data-id="197"
                              style="cursor: pointer"
                            ></i
                            >&nbsp;<span>2</span>
                          </a>
                        </div>
                        <div class="text"><p>ii</p></div>
                      </div>
                    </div>
                  </div>
                  <div class="comment-item" id="comment-196">
                    <div class="body">
                      <div class="avatar">
                        <img
                          class="lazyload"
                          src="https://cdn.shopify.com/s/files/1/1493/7144/products/product-image-16756312_1024x1024.jpg?v=1476865937"
                        />
                      </div>
                      <div class="content">
                        <div class="name"><a href="">匿名用户</a></div>
                        <div class="info">
                          <span class="date">1天前</span>
                          <a href="#respond-post-150" rel="nofollow">回复</a
                          >&nbsp;
                          <a href="#respond-post-150" rel="nofollow">
                            <i
                              class="fa fa-heart-o like"
                              data-id="196"
                              style="cursor: pointer"
                            ></i
                            >&nbsp;<span>3</span>
                          </a>
                        </div>
                        <div class="text"><p>331</p></div>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <p
                id="comments-more"
                style="
                  font-size: 0.8em;
                  text-align: center;
                  font-weight: bold;
                  color: grey;
                  margin: 1em 0 0.5em;
                  cursor: pointer;
                "
              >
                <i class="fa fa-long-arrow-down"></i> &nbsp;&nbsp;加载更多
              </p>
            </div>
          </div>
        </div>
        <aside class="d-bg">
          <div
            id="catalog-box"
            class="card d-bg"
            style="
              display: block;
              width: 287px;
              top: inherit;
              position: relative;
            "
          >
            <div class="tips">
              <i class="fa fa-list-ul" aria-hidden="true"></i>&nbsp;目录
            </div>
            <div id="catalog" style="padding: 0 0.5em">
              <a style="font-weight: bold" href="#h1--rbac-"
                ><i class="fa fa-genderless" style="margin-right: 0.15em"></i
                >一、RBAC是什么</a
              ><a href="#h2-1-rbac-">&nbsp;&nbsp;&nbsp;1、RBAC模型概述</a
              ><a href="#h2-2-rbac-">&nbsp;&nbsp;&nbsp;2、RBAC的组成</a
              ><a href="#h2-3-rbac-">&nbsp;&nbsp;&nbsp;3、RBAC支持的安全原则</a
              ><a href="#h2-4-rbac-">&nbsp;&nbsp;&nbsp;4、RBAC的优缺点</a
              ><a href="#h2-5-rbac-3-">&nbsp;&nbsp;&nbsp;5、RBAC的3种模型</a
              ><a style="font-weight: bold" href="#h1--rbac"
                ><i class="fa fa-genderless" style="margin-right: 0.15em"></i
                >二、如何设计RBAC</a
              ><a href="#h2-1-rbac-">&nbsp;&nbsp;&nbsp;1、RBAC的功能模块</a
              ><a href="#h2-2-rbac-">&nbsp;&nbsp;&nbsp;2、RBAC执行流程</a
              ><a href="#h2-3-rbac-">&nbsp;&nbsp;&nbsp;3、RBAC数据库设计</a>
            </div>
          </div>
          <div class="card">
            <div class="tips"><i class="fa fa-fire"></i>&nbsp;&nbsp;推荐</div>
            <ul class="card-content">
              <li>
                <a href="/note/177.html">PHP反射机制实现自动依赖注入</a>
              </li>
              <li>
                <a href="/note/122.html">收集的一些英文句子和短语</a>
              </li>
              <li>
                <a href="/note/70.html">header 设置页面编码</a>
              </li>
              <li>
                <a href="/note/121.html">npm换源成淘宝镜像</a>
              </li>
              <li>
                <a href="/note/123.html">order by 语句对null字段的默认排序</a>
              </li>
              <li>
                <a href="/note/47.html"
                  >在使用editormd富文本编辑器时使用懒加载</a
                >
              </li>
              <li>
                <a href="/note/124.html">PHP检索类</a>
              </li>
              <li>
                <a href="/note/196.html">高并发下防止库存超卖的解决方案</a>
              </li>
            </ul>
          </div>
        </aside>
      </div>
    </main>
    <Footer />
  </div>
</template>
<script>
import Top from "./Top.vue";
import Header from "../layout/Header.vue";
import Footer from "../layout/Footer.vue";
export default {
  mounted() {
      console.log(this.$router.params)
  },
  components: { Top, Header, Footer },
  name: "Show",
};
</script>

<style>
p {
  margin-top: 0;
  margin-bottom: 1rem;
}

a {
  color: #0d6efd;
  text-decoration: underline;
}

::-moz-focus-inner {
  padding: 0;
  border-style: none;
}

a {
  text-decoration: none;
}

.comment-title {
  font-weight: 700;
  letter-spacing: -0.025em;
  padding: 0.5rem 0.5rem 0 0.5rem;
}

.comment-list .comment-item {
  padding: 0.5rem;
  margin-top: 1rem;
}

.comment-list .comment-item .body {
  display: flex;
}

.comment-list {
  padding: 0;
}

.comment-list .comment-item .avatar {
  margin-right: 0.75rem;
  position: relative;
}

.comment-list .comment-item .avatar img {
  width: 32px;
  height: 32px;
  border-radius: 8px;
}

.comment-list .comment-item .avatar .avatar-dd {
  position: absolute;
  width: 10px;
  height: 10px;
  border-radius: 50rem;
  background-color: var(--theme-color);
  top: 26px;
  left: 26px;
  border: 2px solid #fff;
}

.comment-list .comment-item .content .name a {
  font-size: 0.9rem;
  font-weight: 700;
  color: var(--color-text);
}

.comment-list .comment-item .content .text {
  font-size: 0.85rem;
  padding: 0.8rem;
  font-weight: 400;
  background-color: #f5f5f5;
  border-radius: 0 0.8rem 0.8rem 0.8rem;
  letter-spacing: 0.08rem;
  line-height: 1.45rem;
  color: var(--color-title);
  text-align: justify;
  margin-top: 0.25rem;
}

.comment-list .comment-item .content .text p {
  margin: 0;
  display: inline;
  word-wrap: break-spaces;
  word-break: break-word;
}

.comment-list .comment-item .content .info,
.comment-list .comment-item .content .info a {
  font-size: 0.75rem;
  font-weight: 400;
  color: #aab1ce;
}

.comment-list .comment-item .content .info a:hover {
  border-bottom: 1px solid var(--color-text);
  color: var(--color-text);
}

.comment-box-list > .comment-list > .children {
  margin-left: 2.75rem;
}

.comment-list .children .comment-item .reply-name {
  font-weight: 700;
  padding-right: 0.25rem;
}

@media (max-width: 991.98px) {
  .comment-list .comment-item .content .name {
    font-size: 0.8rem;
    font-weight: 700;
    color: var(--color-text);
  }

  .comment-list .comment-item .content .text {
    font-size: 0.75rem;
    padding: 0.8rem;
    letter-spacing: 0.1rem;
    line-height: 1.2rem;
    margin-top: 0.25rem;
  }

  .comment-list .comment-item .content .info,
  .comment-list .comment-item .content .info a {
    font-size: 0.65rem;
    font-weight: 400;
  }

  .comment-box-list > .comment-list > .children {
    padding-left: 0.75em;
    margin-left: 0.5rem;
    border-left: 0.125rem solid #f5f5f5;
  }
}
/*! CSS Used from: https://www.1kmb.com/static/css/css.css?20210767 */
input {
  font-family: ceym, PingFang\SC, Hiragino\Sans\GB, Microsoft\YaHei, STHeiti,
    WenQuanYi\Micro\Hei, Helvetica, Arial, sans-serif !important;
}
a {
  text-decoration: none;
}
.meme {
  width: 2em;
  height: 2em;
  cursor: pointer;
}
*::-webkit-scrollbar {
  width: 0.3em;
  height: 0.3em;
}
*::-webkit-scrollbar-thumb {
  background-color: black;
  border-radius: 5px;
}
.card-content {
  padding: 0.2em 0.7em;
  margin: 0;
}
span#end::before,
span#end::after {
  content: "";
  background: #e8e8e8;
  width: 20%;
  vertical-align: middle;
  height: 1px;
  display: inline-block;
  margin: 0 16px;
}
.container {
  min-height: 80vh;
  display: flex;
  box-sizing: border-box;
}
#test-editormd-view2 {
  box-sizing: border-box;
  padding: 1em !important;
  transition: all 0.5s;
}
.markdown-body p {
  font-size: 0.95em;
}
#test-editormd-view2 li {
  font-size: 0.95em;
}
#catalog-box {
  display: none;
  z-index: 10;
  padding: 0.5em;
  margin-bottom: 0.5em;
  max-height: 17em;
  box-shadow: rgb(236 236 236) 0 0 6px 0;
  overflow-y: auto;
}
.card {
  box-shadow: rgb(240 240 240) 0 0 4px 0;
  background-color: white;
  border-radius: 5px;
  word-break: break-all;
  padding: 0.5em;
  margin-bottom: 0.5em;
}
aside {
  width: 25%;
  margin-left: 0.5em;
  border-radius: 5px;
}
.card-content > li {
  margin: 0.2em 0;
  list-style-type: none;
  min-height: 1.5em;
}
.card-content > li > a {
  font-size: 0.85em;
  font-weight: bold;
  color: #656565;
  transition: all 0.3s;
}
.card-content > li > a:hover {
  color: #000000;
}
a {
  text-decoration: none;
}
#comment-field {
  box-sizing: border-box;
  padding: 0.5em 0.5em;
  outline: none;
  border: 1px solid #dbdbdb;
  line-height: 1.4em;
  width: 100%;
  min-height: 8em;
  border-radius: 5px;
  resize: vertical;
  margin-bottom: 0.5em;
  font-size: 0.9em;
  transition: all 0.3s;
}
input.user-info {
  font-size: 13px;
  padding: 0 0.6em;
  width: 30%;
  margin-right: 0.5em;
  outline: none;
  border: 1px solid #dbdbdb;
  line-height: 2.5em;
  height: 2.5em;
  border-radius: 5px;
  transition: all 0.3s;
}
#comment-field:focus,
input[name="name"]:focus {
  border: 1px solid #4f70f6;
  box-shadow: #6c8aff 0 0 4px 0;
}
.tips {
  min-height: 1.8em;
  line-height: 1.8em;
  font-weight: bold;
  font-size: 0.95em;
  background-color: white;
  color: grey;
  padding-left: 0.5em;
}
.tips > a {
  color: black;
}
.tips > a:hover {
  color: grey;
}
main {
  margin: 0 auto;
  width: 78%;
}
.editormd-html-preview {
  font-size: 15px;
}
#catalog > a {
  display: block;
  margin: 0.3em 0;
  font-size: 0.85em;
  color: grey;
}
.par-card {
  display: flex;
  justify-content: flex-start;
}
@media screen and (max-width: 880px) {
  #test-editormd-view2 {
    padding: 0.5em !important;
  }
  aside {
    margin: 0 auto;
    width: 97%;
  }
  .left {
    margin: 0 auto !important;
    width: 97% !important;
  }
  main {
    width: 100% !important;
  }
  .d-bg {
    display: none !important;
  }
  .par-card {
    display: flex;
    flex-wrap: wrap;
  }
  .card-sm {
    width: 98% !important;
    margin: 0 auto 0.5em !important;
  }
}
.card-sm {
  box-shadow: rgb(236 236 236) 0 0 3px 0;
  background-color: white;
  border-radius: 5px;
  word-break: break-all;
  width: 33.33%;
  margin: 0 0.25em 0.5em;
  transition: all 0.3s;
}
.card-sm:hover {
  transform: translateY(-5px);
  box-shadow: 0 5px 10px 0 #e5e5e5;
}
.card-sm:first-child {
  margin-left: 0;
}
.card-sm:last-child {
  margin-right: 0;
}
@media all {
  .icon {
    width: 18px;
    height: 18px;
    vertical-align: -3px;
    fill: currentColor;
    overflow: hidden;
  }
  @media screen and (max-width: 800px) {
    body .post-qrcode-btn {
      display: none;
    }
  }
  @media screen and (max-width: 500px) {
    body #reward-plane img {
      max-width: 150px;
    }
    body .post-pop-plane {
      padding: 10px;
    }
  }
  ::-webkit-scrollbar-thumb {
    border-radius: var(--border-hd);
    -webkit-box-shadow: inset 0 0 6px rgba(0, 0, 0, 0.3);
    background-color: #c0c4cc;
  }
  .post-end-tool-btns {
    text-align: center;
    position: relative;
    display: flex;
    justify-content: center;
    width: 100%;
    margin: 20px 0;
  }
  .post-end-tool-btn-item {
    display: inline-block;
    font-size: 14px;
    text-align: center;
    white-space: nowrap;
    padding: 0 10px;
  }
  .post-end-tool-btns svg {
    width: 30px;
    height: 30px;
    display: block;
    fill: currentColor;
    color: #83878a;
    margin: 0 auto;
    transition: 0.3s;
  }
  .post-end-tool-btn-item svg:hover {
    color: var(--MaincolorHover);
  }
  .post-share-list svg {
    width: 30px;
    height: 30px;
  }
  #qrcode-plane img {
    max-width: 100px;
    width: 100%;
  }
  #reward-plane img {
    max-width: 200px;
  }
  .post-pop-plane {
    transition: 0.5s;
    visibility: hidden;
    opacity: 0;
    position: absolute;
    box-shadow: 0 2px 8px 0 rgb(0 0 0 / 10%);
    z-index: 999;
    border-radius: 10px;
    padding: 20px;
    background: #fff;
  }
  #share-plane svg {
    display: inline-block;
  }
  canvas {
    width: 100%;
  }
}
/*! CSS Used from: https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/css/font-awesome.css */
.fa {
  display: inline-block;
  font: normal normal normal 14px/1 FontAwesome;
  font-size: inherit;
  text-rendering: auto;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
}
.fa-fire:before {
  content: "\f06d";
}
.fa-heart-o:before {
  content: "\f08a";
}
.fa-link:before {
  content: "\f0c1";
}
.fa-bars:before {
  content: "\f0c9";
}
.fa-list-ul:before {
  content: "\f0ca";
}
.fa-smile-o:before {
  content: "\f118";
}
.fa-long-arrow-down:before {
  content: "\f175";
}
.fa-paper-plane-o:before {
  content: "\f1d9";
}
.fa-genderless:before {
  content: "\f22d";
}
/*! CSS Used from: https://www.1kmb.com/static/editor/css/editormd.preview.css */
.fa {
  display: inline-block;
  font: normal normal normal 14px/1 FontAwesome;
  font-size: inherit;
  text-rendering: auto;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  transform: translate(0, 0);
}
.fa-fire:before {
  content: "\f06d";
}
.fa-heart-o:before {
  content: "\f08a";
}
.fa-link:before {
  content: "\f0c1";
}
.fa-bars:before {
  content: "\f0c9";
}
.fa-list-ul:before {
  content: "\f0ca";
}
.fa-smile-o:before {
  content: "\f118";
}
.fa-long-arrow-down:before {
  content: "\f175";
}
.fa-paper-plane-o:before {
  content: "\f1d9";
}
.fa-genderless:before {
  content: "\f1db";
}
.markdown-body {
  -ms-text-size-adjust: 100%;
  -webkit-text-size-adjust: 100%;
  color: #333;
  overflow: hidden;
  font-family: "Microsoft YaHei", Helvetica, "Meiryo UI", "Malgun Gothic",
    "Segoe UI", "Trebuchet MS", "Monaco", monospace, Tahoma, STXihei, "华文细黑",
    STHeiti, "Helvetica Neue", "Droid Sans", "wenquanyi micro hei", FreeSans,
    Arimo, Arial, SimSun, "宋体", Heiti, "黑体", sans-serif;
  font-size: 16px;
  line-height: 1.6;
  word-wrap: break-word;
}
.markdown-body a {
  background: transparent;
}
.markdown-body a:active,
.markdown-body a:hover {
  outline: 0;
}
.markdown-body h1 {
  font-size: 2em;
  margin: 0.67em 0;
}
.markdown-body img {
  border: 0;
}
.markdown-body * {
  -moz-box-sizing: border-box;
  box-sizing: border-box;
}
.markdown-body a {
  color: #4183c4;
  text-decoration: none;
}
.markdown-body a:hover,
.markdown-body a:active {
  text-decoration: underline;
}
.markdown-body h1,
.markdown-body h2,
.markdown-body h3 {
  margin-top: 15px;
  margin-bottom: 15px;
  line-height: 1.1;
}
.markdown-body h1 {
  font-size: 30px;
}
.markdown-body h2 {
  font-size: 21px;
}
.markdown-body h3 {
  font-size: 16px;
}
.markdown-body ul {
  padding: 0;
  margin-top: 0;
  margin-bottom: 0;
}
.markdown-body .octicon {
  font: normal normal 16px octicons-anchor;
  line-height: 1;
  display: inline-block;
  text-decoration: none;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  -webkit-user-select: none;
  -moz-user-select: none;
  -ms-user-select: none;
  user-select: none;
}
.markdown-body .octicon-link:before {
  content: "\f05c";
}
.markdown-body > *:first-child {
  margin-top: 0 !important;
}
.markdown-body > *:last-child {
  margin-bottom: 0 !important;
}
.markdown-body h1,
.markdown-body h2,
.markdown-body h3 {
  position: relative;
  margin-top: 1em;
  margin-bottom: 16px;
  font-weight: bold;
  line-height: 1.4;
}
.markdown-body h1 .octicon-link,
.markdown-body h2 .octicon-link,
.markdown-body h3 .octicon-link {
  display: none;
  color: #000;
  vertical-align: middle;
}
.markdown-body h1 {
  padding-bottom: 0.3em;
  font-size: 2.25em;
  line-height: 1.2;
  border-bottom: 1px solid #eee;
}
.markdown-body h2 {
  padding-bottom: 0.3em;
  font-size: 1.75em;
  line-height: 1.225;
  border-bottom: 1px solid #eee;
}
.markdown-body h3 {
  font-size: 1.5em;
  line-height: 1.43;
}
.markdown-body p,
.markdown-body ul {
  margin-top: 0;
  margin-bottom: 16px;
}
.markdown-body ul {
  padding-left: 2em;
}
.markdown-body img {
  max-width: 100%;
  -moz-box-sizing: border-box;
  box-sizing: border-box;
}
.editormd-html-preview {
  text-align: left;
  font-size: 16px;
  line-height: 1.6;
  padding: 20px;
  overflow: auto;
  width: 100%;
  background-color: #fff;
}
/*! CSS Used from: Embedded */
p {
  margin-top: 0;
  margin-bottom: 1rem;
}
a {
  color: #0d6efd;
  text-decoration: underline;
}
::-moz-focus-inner {
  padding: 0;
  border-style: none;
}
a {
  text-decoration: none;
}
.comment-list .comment-item {
  padding: 0.5rem;
  margin-top: 1rem;
}
.comment-list .comment-item .body {
  display: flex;
}
.comment-list {
  padding: 0;
}
.comment-list .comment-item .avatar {
  margin-right: 0.75rem;
  position: relative;
}
.comment-list .comment-item .avatar img {
  width: 32px;
  height: 32px;
  border-radius: 8px;
}
.comment-list .comment-item .content .name a {
  font-size: 0.9rem;
  font-weight: 700;
  color: var(--color-text);
}
.comment-list .comment-item .content .text {
  font-size: 0.85rem;
  padding: 0.8rem;
  font-weight: 400;
  background-color: #f5f5f5;
  border-radius: 0 0.8rem 0.8rem 0.8rem;
  letter-spacing: 0.08rem;
  line-height: 1.45rem;
  color: var(--color-title);
  text-align: justify;
  margin-top: 0.25rem;
}
.comment-list .comment-item .content .text p {
  margin: 0;
  display: inline;
  word-wrap: break-spaces;
  word-break: break-word;
}
.comment-list .comment-item .content .info,
.comment-list .comment-item .content .info a {
  font-size: 0.75rem;
  font-weight: 400;
  color: #aab1ce;
}
.comment-list .comment-item .content .info a:hover {
  border-bottom: 1px solid var(--color-text);
  color: var(--color-text);
}
@media (max-width: 991.98px) {
  .comment-list .comment-item .content .name {
    font-size: 0.8rem;
    font-weight: 700;
    color: var(--color-text);
  }
  .comment-list .comment-item .content .text {
    font-size: 0.75rem;
    padding: 0.8rem;
    letter-spacing: 0.1rem;
    line-height: 1.2rem;
    margin-top: 0.25rem;
  }
  .comment-list .comment-item .content .info,
  .comment-list .comment-item .content .info a {
    font-size: 0.65rem;
    font-weight: 400;
  }
}
/*! CSS Used fontfaces */
@font-face {
  font-family: ceym;
  src: url("https://www.1kmb.com/static/fonts/ceym.woff2");
}
@font-face {
  font-family: "FontAwesome";
  src: url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.eot?v=4.7.0");
  src: url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.eot#iefix&v=4.7.0")
      format("embedded-opentype"),
    url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.woff2?v=4.7.0")
      format("woff2"),
    url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.woff?v=4.7.0")
      format("woff"),
    url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.ttf?v=4.7.0")
      format("truetype"),
    url("https://cdn.bootcdn.net/ajax/libs/font-awesome/4.7.0/fonts/fontawesome-webfont.svg?v=4.7.0#fontawesomeregular")
      format("svg");
  font-weight: normal;
  font-style: normal;
}
@font-face {
  font-family: "FontAwesome";
  src: url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.eot?v=4.3.0");
  src: url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.eot#iefix&v=4.3.0")
      format("embedded-opentype"),
    url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.woff2?v=4.3.0")
      format("woff2"),
    url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.woff?v=4.3.0")
      format("woff"),
    url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.ttf?v=4.3.0")
      format("truetype"),
    url("https://www.1kmb.com/static/editor/fonts/fontawesome-webfont.svg?v=4.3.0#fontawesomeregular")
      format("svg");
  font-weight: normal;
  font-style: normal;
}
@font-face {
  font-family: octicons-anchor;
  src: url(data:font/woff;charset=utf-8;base64,d09GRgABAAAAAAYcAA0AAAAACjQAAQAAAAAAAAAAAAAAAAAAAAAAAAAAAABGRlRNAAABMAAAABwAAAAca8vGTk9TLzIAAAFMAAAARAAAAFZG1VHVY21hcAAAAZAAAAA+AAABQgAP9AdjdnQgAAAB0AAAAAQAAAAEACICiGdhc3AAAAHUAAAACAAAAAj//wADZ2x5ZgAAAdwAAADRAAABEKyikaNoZWFkAAACsAAAAC0AAAA2AtXoA2hoZWEAAALgAAAAHAAAACQHngNFaG10eAAAAvwAAAAQAAAAEAwAACJsb2NhAAADDAAAAAoAAAAKALIAVG1heHAAAAMYAAAAHwAAACABEAB2bmFtZQAAAzgAAALBAAAFu3I9x/Nwb3N0AAAF/AAAAB0AAAAvaoFvbwAAAAEAAAAAzBdyYwAAAADP2IQvAAAAAM/bz7t4nGNgZGFgnMDAysDB1Ml0hoGBoR9CM75mMGLkYGBgYmBlZsAKAtJcUxgcPsR8iGF2+O/AEMPsznAYKMwIkgMA5REMOXicY2BgYGaAYBkGRgYQsAHyGMF8FgYFIM0ChED+h5j//yEk/3KoSgZGNgYYk4GRCUgwMaACRoZhDwCs7QgGAAAAIgKIAAAAAf//AAJ4nHWMMQrCQBBF/0zWrCCIKUQsTDCL2EXMohYGSSmorScInsRGL2DOYJe0Ntp7BK+gJ1BxF1stZvjz/v8DRghQzEc4kIgKwiAppcA9LtzKLSkdNhKFY3HF4lK69ExKslx7Xa+vPRVS43G98vG1DnkDMIBUgFN0MDXflU8tbaZOUkXUH0+U27RoRpOIyCKjbMCVejwypzJJG4jIwb43rfl6wbwanocrJm9XFYfskuVC5K/TPyczNU7b84CXcbxks1Un6H6tLH9vf2LRnn8Ax7A5WQAAAHicY2BkYGAA4teL1+yI57f5ysDNwgAC529f0kOmWRiYVgEpDgYmEA8AUzEKsQAAAHicY2BkYGB2+O/AEMPCAAJAkpEBFbAAADgKAe0EAAAiAAAAAAQAAAAEAAAAAAAAKgAqACoAiAAAeJxjYGRgYGBhsGFgYgABEMkFhAwM/xn0QAIAD6YBhwB4nI1Ty07cMBS9QwKlQapQW3VXySvEqDCZGbGaHULiIQ1FKgjWMxknMfLEke2A+IJu+wntrt/QbVf9gG75jK577Lg8K1qQPCfnnnt8fX1NRC/pmjrk/zprC+8D7tBy9DHgBXoWfQ44Av8t4Bj4Z8CLtBL9CniJluPXASf0Lm4CXqFX8Q84dOLnMB17N4c7tBo1AS/Qi+hTwBH4rwHHwN8DXqQ30XXAS7QaLwSc0Gn8NuAVWou/gFmnjLrEaEh9GmDdDGgL3B4JsrRPDU2hTOiMSuJUIdKQQayiAth69r6akSSFqIJuA19TrzCIaY8sIoxyrNIrL//pw7A2iMygkX5vDj+G+kuoLdX4GlGK/8Lnlz6/h9MpmoO9rafrz7ILXEHHaAx95s9lsI7AHNMBWEZHULnfAXwG9/ZqdzLI08iuwRloXE8kfhXYAvE23+23DU3t626rbs8/8adv+9DWknsHp3E17oCf+Z48rvEQNZ78paYM38qfk3v/u3l3u3GXN2Dmvmvpf1Srwk3pB/VSsp512bA/GG5i2WJ7wu430yQ5K3nFGiOqgtmSB5pJVSizwaacmUZzZhXLlZTq8qGGFY2YcSkqbth6aW1tRmlaCFs2016m5qn36SbJrqosG4uMV4aP2PHBmB3tjtmgN2izkGQyLWprekbIntJFing32a5rKWCN/SdSoga45EJykyQ7asZvHQ8PTm6cslIpwyeyjbVltNikc2HTR7YKh9LBl9DADC0U/jLcBZDKrMhUBfQBvXRzLtFtjU9eNHKin0x5InTqb8lNpfKv1s1xHzTXRqgKzek/mb7nB8RZTCDhGEX3kK/8Q75AmUM/eLkfA+0Hi908Kx4eNsMgudg5GLdRD7a84npi+YxNr5i5KIbW5izXas7cHXIMAau1OueZhfj+cOcP3P8MNIWLyYOBuxL6DRylJ4cAAAB4nGNgYoAALjDJyIAOWMCiTIxMLDmZedkABtIBygAAAA==)
    format("woff");
}
</style>